main.floors.BH14=
{
    "floorId": "BH14",
    "title": "北寒帝国 4 ",
    "name": "北寒帝国4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X130012",
    "bgm": "xieedushi.mp3",
    "weather": [
        "snow",
        6
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,10": [
            "\t[希娜,N538]\b[this]北纳家族被灭，我父皇和兄弟姐妹们应该很快就会知道，咱们要尽快动手。",
            "\t[莫析辉,hero]\b[hero]你也是个大孝女呀。",
            "\t[希娜,N538]\b[this]没办法了，皇位之争，本来就是你死我活的斗争。也不知道默默、童轩、铁姝在南荒帝国做的怎么样了。",
            "\t[莫析辉,hero]\b[hero]嗯，希望他们能全身而退。",
            "\t[莫析辉,hero]\b[hero]对了，你之后打算怎么对你父皇？",
            "\t[希娜,N538]\b[this]父女一场，我只要逼他退位就可以了……",
            "\t[莫析辉,hero]\b[hero]但愿如此吧……",
            "\t[希娜,N538]\b[this]圣子殿下，你我夫妻一体，已无回头箭，要是我败了，你面临的可是北寒帝国全力支持你的敌人。如果父皇执意……我也不得不……",
            "\t[莫析辉,hero]\b[hero]你不会要……要……",
            "\t[希娜,N538]\b[this]没有杀伐果断的决策，怎么能成为女皇！我成为女皇之后，我会全力支持你成为光明教皇的，走吧，殿下。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "BH15",
            "loc": [
                6,
                0
            ]
        },
        "6,12": {
            "floorId": "BH13",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [130019,130018,130031,20318,130029,130019, 91,130029,130019,130031,130018,130031,20311],
    [801, 22,344,346,686,20318,  0,20308,346,  0,703,130019,686],
    [ 81,20308,130018,130029,130019,130031,685,130031,  0,799,  0,20311,347],
    [797,  0, 21,  0,800, 81,  0,20311,130029, 81,20311,130031,800],
    [130029,799,130018,130031,130019,20311,797,130029,  0,  0,347,20308,799],
    [20318,344,130029,703,798, 81,  0, 81,798,685,  0,130018,346],
    [130031,685,20311,347,703,130018,344,20308,  0,  0, 21,130031,344],
    [20311, 21,130031,20308,130018,130029,  0,130029,20308, 82,130019,20318, 81],
    [130031,685,20318,346,710,20311,796,  0,796,  0,685,130029,798],
    [130029,347,130029,710,798, 81,  0,  0,130018,130019,799,20308,  0],
    [130019,797,20308,130031,130018,130019,  0,538,130031,617,349,130031,686],
    [20311,  0, 21,  0,796, 82,685,  0,20311,130029,130018,130019,  0],
    [130031,20311,130019,130031,130029,130018, 91,  0,796,  0,685, 81,797]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        6,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}