main.floors.BH3=
{
    "floorId": "BH3",
    "title": "北寒小道 3 ",
    "name": "北寒小道3",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10006",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,3": [
            "\t[罗涛,N582]\b[this]殿下，此处魔物横行，不过它们的实力都不算很强，就留给殿下锻炼啦。属下先去前面开路。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "BH2",
            "loc": [
                6,
                12
            ]
        },
        "0,1": {
            "floorId": "BH4",
            "loc": [
                0,
                1
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,140,140,140,140,140,140,140],
    [ 92,202,  0, 21,680,  0,201,  0,140, 27,  0,680,140],
    [140,140,140,140,140,140,140, 81,140,  0,605,  0,140],
    [140,202,  0, 28,  0,205,  0,582,140,  0,202,  0,140],
    [140, 81,140,140,140,140,140,140,140,10300, 81,140,140],
    [140,681,  0,201,  0, 29,  0,205,  0, 21,  0,201,140],
    [140,140,140,140,140, 82,140,140,140,140,140, 81,140],
    [140,710,  0,680,  0,205,140,  0,217,  0,  0,680,140],
    [140,140, 81,140,140,  0,140,605,140,140, 81,140,140],
    [140,  0,209,  0,140, 29,140,  0,140,  0,205,  0,140],
    [140,  0, 28,  0,140,  0,60410,202,140,  0, 21,  0,140],
    [140,681,  0,605,140,201,  0,  0,140, 21,  0, 21,140],
    [140,140,140,140,140,140, 91,60395,140,140,140,140,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}