main.floors.BH6=
{
    "floorId": "BH6",
    "title": "北寒小道 6 ",
    "name": "北寒小道6",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10006",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            "\t[罗涛,N582]\b[this]殿下，那个僵尸史莱姆王很厉害，你现在应该应付不了，不过好在它没有挡路，以后你能够解决了再来练手吧！我这里有一瓶绿血瓶，交给殿下了",
            {
                "type": "setValue",
                "name": "item:greenPotion",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "BH5",
            "loc": [
                6,
                0
            ]
        },
        "6,12": {
            "floorId": "BH7",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140, 93,140,140,140,140,140,140],
    [140,  0, 29,  0,205,  0,582,  0,209,  0, 21,  0,140],
    [140,217,140,140,140,140,140,140,140,140,140,210,140],
    [140, 81,140,  0, 82,  0,140,711, 82,  0,140,  0,140],
    [140,680,140,209,140,203,140,  0,140,211,140, 27,140],
    [140,  0,140, 21,140,680,140,206,140, 21,140,  0,140],
    [140,202,140,710,140, 28,140,345,140,606,140,217,140],
    [140,  0,140, 21,140, 29,140,344,140,683,140,  0,140],
    [140,681,140,210,140,217,140,211,140,736,140,681,140],
    [140,  0,140,408,140,  0,221,  0,140,718,140,  0,140],
    [140,205,140,140,140,140, 83,140,140,140,140,203,140],
    [140,  0, 82,  0,209,  0,681,  0,209,  0,710,  0,140],
    [140,140,140,140,140,140, 93,140,140,140,140,140,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ]
}