main.floors.BN10=
{
    "floorId": "BN10",
    "title": "北纳家族 10 ",
    "name": "北纳家族10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10003",
    "bgm": "ending.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "BN13",
            "loc": [
                6,
                9
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,5": [
            {
                "type": "setBlock",
                "number": "I498",
                "loc": [
                    [
                        5,
                        6
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "greenKey",
                "loc": [
                    [
                        7,
                        6
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "E779",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            {
                "type": "confirm",
                "text": "确认要跳过剧情吗?",
                "yes": [
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "show",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    {
                        "type": "setBlock",
                        "number": "N1169",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                3
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    "\t[光明圣子,hero]该死！我遭到算计了！恐怕北纳蜜西娅会去\r[red]圣子宫\r[]找我算账"
                ],
                "no": [
                    "\t[北纳逸,E779]\b[this,6,5]不愧是光明圣子……你的天赋出众，现在实力已经不逊于任何一家家主了",
                    "\t[光明圣子,hero]北纳叔叔如果不心生恶念，我也不会来此一趟",
                    "\t[北纳逸,E779]\b[this,6,5]对不起，我不该和另外几大家族对莫析家族打压……但我没有想过要灭了莫析家族……",
                    "\t[光明圣子,hero]什么！莫析家族不是你灭的！",
                    "\t[北纳逸,E779]\b[this,6,5]我们若想灭掉整个莫析家族，派一个东方溪和安撒哪里够……他们背后恐怕另有高手……",
                    {
                        "type": "playBgm",
                        "name": "guijiezhouyuan.mp3",
                        "startTime": 105
                    },
                    {
                        "type": "animate",
                        "name": "darkattack",
                        "loc": [
                            6,
                            3
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "N1161",
                        "loc": [
                            [
                                6,
                                3
                            ]
                        ]
                    },
                    "\t[黛莫琳,N1161]\b[this,6,3]哈哈哈哈哈！啊哈哈哈哈！",
                    "\t[北纳逸,E779]\b[this,6,5]什么人！",
                    "\t[黛莫琳,N1161]\b[this,6,3]圣子哥哥，既然打败了灭族仇人，何不快快杀了，与他废这么多话！不如让小妹为哥哥动手！",
                    {
                        "type": "animate",
                        "name": "chanrao",
                        "loc": [
                            6,
                            4
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "zhuanhua",
                        "loc": [
                            6,
                            4
                        ]
                    },
                    "\t[北纳逸,E779]\b[this,6,5]啊啊啊啊啊啊！",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "remove": true
                    },
                    "\t[光明圣子,hero]黑暗魔法！黛莫琳，你……！",
                    "\t[黛莫琳,N1161]\b[this,6,3]圣子哥哥，怎么如此惊讶呢",
                    "\t[光明圣子,hero]黛莫琳，你是\r[red]黑暗圣女\r[]。",
                    "\t[黛莫琳,N1161]\b[this,6,3]圣子哥哥真是聪明，不过小妹我就不陪了，啊哈哈哈哈！",
                    {
                        "type": "show",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    {
                        "type": "setBlock",
                        "number": "N1169",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                3
                            ]
                        ]
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                3
                            ]
                        ],
                        "floorId": "MT0"
                    },
                    "\t[光明圣子,hero]该死！我遭到算计了！恐怕北纳蜜西娅会去\r[red]圣子宫\r[]找我算账"
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145],
    [40145,  0,  0,  0,  0,  0,40352,  0,  0,  0,  0,  0,40145],
    [40145,  0,  0,  0,  0,  0,40360,  0,  0,  0,  0,  0,40145],
    [40145,40720,40721,  0,  0,  0,  0,  0,  0,  0,41640,41641,40145],
    [40145,40728,40729,  0,  0,  0,  0,  0,  0,  0,41648,41649,40145],
    [40145,40736,40737,41152,41262,  0,779,  0,41263,41152,41656,41657,40145],
    [40145,  0,  0,41160,41270,  0,  0,  0,41271,41160,  0,41852,40145],
    [40145,  0,  0,  0,41278,  0,  0,  0,41279,  0,  0,  0,40145],
    [40145,  0,  0,  0,41152,  0,  0,  0,41152,  0,  0,  0,40145],
    [40145,40722,40723,  0,41160,  0,  0,  0,41160,  0,40858,40859,40145],
    [40145,40730,40731,  0,  0,  0,  0,  0,  0,  0,40866,40867,40145],
    [40145,40738,40739,  0,  0,  0,  0,  0,  0,  0,40850,40851,40145],
    [40145,40145,40145,40145,40145,40145, 91,40145,40145,40145,40145,40145,40145]
],
    "bgmap": [
    [40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145],
    [40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145],
    [40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145,40145],
    [  0,  0,  0,  0,  0,  0,40368,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,40528,40529,40529,40529,40530,  0,  0,  0,  0],
    [  0,  0,  0,  0,40536,40537,40537,40537,40538,  0,  0,  0,  0],
    [  0,  0,  0,  0,40536,40537,40537,40537,40538,  0,  0,  0,  0],
    [  0,  0,  0,  0,40536,40537,40537,40537,40538,  0,  0,  0,  0],
    [  0,  0,  0,  0,40544,40545,40545,40545,40546,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,40423,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,40386,  0,40431,  0,40386,  0,  0,  0,  0],
    [  0,  0,  0,  0,40394,  0,  0,  0,40394,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "flyPoint": [
        6,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}