main.floors.CZ2=
{
    "floorId": "CZ2",
    "title": "村庄 2 ",
    "name": "村庄2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "setBlock",
                "number": "specialDoor",
                "loc": [
                    [
                        6,
                        9
                    ]
                ]
            },
            {
                "type": "changePos",
                "loc": [
                    6,
                    8
                ],
                "direction": "down"
            },
            "\t[三长老,king]哈哈，圣子殿下，竟然被这点东西吸引了",
            "\t[光明圣子]三长老，你干什么!",
            "\t[三长老,king]我干什么？你太天真啦!你是莫析家族天赋最强的人，等你成为下一任光明教皇，岂能有我北纳家族的位置?让我替圣女把你除了吧！哈哈哈哈",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "CZ1",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20,419,416,410,398,413, 20, 20, 20, 20],
    [ 20, 20, 20, 20,402,402,402,402,402, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 21, 21, 21, 21, 21, 20, 20, 20, 20],
    [ 20, 20, 20, 20,434,403, 22,403,437, 20, 20, 20, 20],
    [ 20, 20, 20, 20,434,403,  0,403,437, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,1140,  0,1140, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 91, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        6,
        12
    ]
}