main.floors.CZ4=
{
    "floorId": "CZ4",
    "title": "村庄 4 ",
    "name": "村庄4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [
        "\t[光明圣子]想不到神殿这么近的地方，竟然冒出如此多的怪物……还伤了不少村民"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,6": [
            "\t[沂蒙贤,N570]\b[this,4,6]圣子啊，你知道白宝石应该怎么用吗",
            "\t[光明圣子,hero]\b[hero]不知道唉，还请三长老指点",
            "\t[沂蒙贤,N570]\b[this,4,6]一定要用白宝石多加生命值，这样才最划算",
            "\t[光明圣子,hero]\b[hero]是",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "CZ1",
            "loc": [
                0,
                6
            ]
        },
        "6,12": {
            "floorId": "CZ5",
            "loc": [
                6,
                0
            ]
        },
        "0,6": {
            "floorId": "CZ6",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,355, 20, 21,365,612,729,730, 20,688,613, 21, 20],
    [ 20,688, 20, 20, 20, 20, 20,  0, 20,  0,744,  0, 20],
    [ 20,730, 20,  0,  0,354, 81,728, 20, 20, 81, 20, 20],
    [ 20,  0, 20,729,687,  0,10300,  0,728,  0,  0,361, 20],
    [ 20,  0, 20, 81, 20, 20,10300, 20, 20, 20, 20, 20, 20],
    [ 92,728,  0,  0,570,  0,728,687, 20, 21,  0,  0, 92],
    [ 20,  0, 20, 20, 81, 20, 20,  0, 20,  0,456,  0, 20],
    [ 20,361, 20,  0,730,  0, 20,  0, 81,728,  0, 21, 20],
    [ 20,688, 20,688,356,601, 20,728, 20, 20, 81, 20, 20],
    [ 20,  0,729, 20, 20, 20,10300,  0, 20,  0,729,  0, 20],
    [ 20,730,  0,  0,688,  0,729,  0, 20, 21, 21, 21, 20],
    [697,609, 20, 20, 20, 20, 93,60395, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        12,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}