main.floors.CZ4=
{
    "floorId": "CZ4",
    "title": "村庄 4 ",
    "name": "村庄4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [
        "\t[光明圣子]想不到神殿这么近的地方，竟然冒出如此多的怪物……还伤了不少村民"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,6": [
            "\t[三长老,king]\b[this,4,6]圣子啊，你知道白宝石应该怎么用吗",
            "\t[光明圣子,hero]\b[up]不知道唉，还请三长老指点",
            "\t[三长老,king]\b[this,4,6]一定要用白宝石多加生命值，这样才最划算",
            "\t[光明圣子,hero]\b[up]是",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "CZ1",
            "loc": [
                0,
                6
            ]
        },
        "6,12": {
            "floorId": "CZ5",
            "loc": [
                6,
                0
            ]
        },
        "0,6": {
            "floorId": "CZ6",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 28, 20, 21,417,399,266,203, 20, 32,398, 21, 20],
    [ 20, 32, 20, 20, 20, 20, 20,  0, 20,  0,205,  0, 20],
    [ 20,203, 20,  0,  0, 27, 81,201, 20, 20, 81, 20, 20],
    [ 20,  0, 20,202, 32,  0,20410,  0,265,  0,  0, 29, 20],
    [ 20,  0, 20, 81, 20, 20,20410, 20, 20, 20, 20, 20, 20],
    [ 94,265,  0,  0,127,  0,201, 31, 20, 21,  0,  0, 92],
    [ 20,  0, 20, 20, 81, 20, 20,  0, 20,  0,1060,  0, 20],
    [ 20, 29, 20,  0,203,  0, 20,  0, 81,201,  0, 21, 20],
    [ 20, 32, 20, 31,416,1128, 20,201, 20, 20, 81, 20, 20],
    [ 20,  0,202, 20, 20, 20,10300,  0, 20,  0,202,  0, 20],
    [ 20,203,  0,  0, 32,  0,202,  0, 20, 21, 21, 21, 20],
    [1174,397, 20, 20, 20, 20, 91,20395, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        12,
        6
    ]
}