main.floors.CZ5=
{
    "floorId": "CZ5",
    "title": "村庄 5 ",
    "name": "村庄5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,8": [
            "\t[温明啸,N550]\b[this]如果没有血了，可以使用“光明宝典”将魔力转换成生命值哦，现在我恢复你500点魔力值",
            {
                "type": "setValue",
                "name": "status:mana",
                "operator": "+=",
                "value": "500"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "CZ4",
            "loc": [
                6,
                12
            ]
        },
        "12,6": {
            "floorId": "CZ3",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140, 93,140,140,140,140,140,140],
    [140,728, 81,  0,140,688,  0,688,140, 21,361,689,140],
    [140,728,140,602,140,  0,728,  0,140,  0,360,  0,140],
    [140,744,140,  0,140,140, 81,140,140,140,729,140,140],
    [140,610,140,  0,729,  0,  0,728,  0,686,  0,  0,140],
    [140,690,140, 81,140,140,140,140,140,140,140,728,140],
    [140,362,140,  0,  0,729, 22,689,358,140,689,  0, 94],
    [140,690,140,730,140,140,140,140,140,140,  0,361,140],
    [140,610,140,  0,358,140,  0, 21,  0,729,  0,550,140],
    [140,744,140, 21,  0,140,690,140,140,140, 81,140,140],
    [140,728,140,  0,689,140,  0,710,140,  0,730,  0,140],
    [140,728, 81,  0,  0,728,  0,10300,140, 21,698,690,140],
    [140,140,140,140,140,140,140,10300,10300,140,140,140,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        6,
        0
    ],
    "bg2map": [

],
    "fg2map": [

]
}