main.floors.CZ6=
{
    "floorId": "CZ6",
    "title": "村庄 6 ",
    "name": "村庄6",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": [
            "\t[光明圣子]六长老?",
            "\t[六长老,trader]生活困难，卖点东西赚钱",
            "\t[光明圣子]牛逼!你敢赚我的钱，不怕教皇爷爷怪罪?",
            "\t[六长老,trader]呵呵，我可不是你家伯伯，要白嫖找他去",
            "\t[光明圣子]真是块硬石头，那我看看你店里有些什么",
            {
                "type": "openShop",
                "id": "itemShop2",
                "open": true
            }
        ],
        "9,6": [
            "\t[凌依,N1151]\b[this,9,6]拜见圣子殿下，这个附近怪物很多，离神殿越远，怪物越强，村民们的尸体已经被尽数埋葬了",
            "\t[光明圣子,hero]\b[up]凌依，你以为这是什么人领导的，能让这么多魔物在神殿附近伤人",
            "\t[凌依,N1151]\b[this,9,6]能在光明神殿伤人，除非……",
            "\t[光明圣子,hero]\b[up]黑暗神殿?",
            "\t[凌依,N1151]\b[this,9,6]准确的说，应该是黑暗圣子，我们几个光明骑士与一个人交手过，他很强，自称黑暗圣子……",
            "\t[光明圣子,hero]\b[up]黑暗圣子……",
            "\t[凌依,N1151]\b[this,9,6]殿下，你可要小心",
            "\t[光明圣子,hero]\b[up]嗯，你继续去探查!",
            "\t[凌依,N1151]\b[this,9,6]属下告退!",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "CZ4",
            "loc": [
                0,
                6
            ]
        },
        "6,0": {
            "floorId": "CZ7",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140, 93, 20, 20, 20, 20, 20, 20],
    [140,216, 81,  0,  0,205,  0,  0,265,  0, 81, 32, 20],
    [140,  0, 20,  0, 32, 20, 20, 82, 20, 20, 20,  0, 20],
    [140, 21, 20, 21,  0, 20, 31, 32,419, 21, 20,266, 20],
    [140,402, 20, 20, 81, 20, 29,208,491,399, 20,  0, 20],
    [140,397, 20,  0,203, 20, 20, 81, 20, 20, 20,205, 20],
    [140,232, 20, 27,  0,  0,266,  0,  0,1151,  0,  0, 92],
    [140,  0, 20,205, 20, 20, 20, 81, 20, 20, 20, 81, 20],
    [140,206, 81,  0,  0,  0,  0,204,  0,  0, 20,205, 20],
    [140, 21, 20,265, 20, 20, 81, 20, 20, 32, 20, 31, 20],
    [140,403, 20, 21, 20,413,209,416, 20,  0, 20, 31, 20],
    [140,460, 20, 31, 20,410,122,398, 82,265, 81, 31, 20],
    [140, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        12,
        6
    ]
}