main.floors.CZ6=
{
    "floorId": "CZ6",
    "title": "村庄 6 ",
    "name": "村庄6",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,6": [
            "\t[凌依,N574]\b[this,9,6]拜见圣子殿下，这个附近怪物很多，离神殿越远，怪物越强，村民们的尸体已经被尽数埋葬了",
            "\t[光明圣子,hero]\b[hero]凌依，你以为这是什么人领导的，能让这么多魔物在神殿附近伤人",
            "\t[凌依,N574]\b[this,9,6]能在光明神殿伤人，除非……",
            "\t[光明圣子,hero]\b[hero]黑暗神殿?",
            "\t[凌依,N574]\b[this,9,6]准确的说，应该是黑暗圣子，我们几个光明骑士与一个人交手过，他很强，自称黑暗圣子……",
            "\t[光明圣子,hero]\b[hero]黑暗圣子……",
            "\t[凌依,N574]\b[this,9,6]殿下，你可要小心",
            "\t[光明圣子,hero]\b[hero]嗯，你继续去探查!",
            "\t[凌依,N574]\b[this,9,6]属下告退!",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "CZ4",
            "loc": [
                0,
                6
            ]
        },
        "6,0": {
            "floorId": "CZ7",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140, 91, 20, 20, 20, 20, 20, 20],
    [140,253, 81,  0,  0,744,  0,  0,728,  0, 81,688, 20],
    [140,  0, 20,  0,688, 20, 20, 82, 20, 20, 20,  0, 20],
    [140, 21, 20, 21,  0, 20,689,688,362,610, 20,729, 20],
    [140,688, 20, 20, 81, 20,365,237,710,358, 20,  0, 20],
    [140,610, 20,  0,730, 20, 20, 81, 20, 20, 20,744, 20],
    [140,731, 20,358,  0,  0,729,  0,  0,574,  0,  0, 92],
    [140,  0, 20,744, 20, 20, 20, 81, 20, 20, 20, 81, 20],
    [140,745, 81,  0,  0, 21,  0,731,  0,  0, 20,744, 20],
    [140, 21, 20,728, 20, 20, 81, 20, 20,688, 20,689, 20],
    [140,602, 20, 21, 20,364,238,365, 20,  0, 20,689, 20],
    [140,690, 20,688, 20,363,698,611, 82,728, 81,689, 20],
    [140, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        12,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}