main.floors.DL2=
{
    "floorId": "DL2",
    "title": "东凌帝国 2 ",
    "name": "东凌帝国2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "X20061",
    "bgm": "jw.mp3",
    "firstArrive": [
        {
            "type": "jumpHero",
            "loc": [
                7,
                8
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[众光明骑士,N440]恭迎大长老！恭迎两位圣子殿下！",
        "\t[图毅,E828]\b[this,6,4]光明神殿大长老和两位圣子大驾光临，图毅有失远迎。",
        "\t[芹宣,N466]\b[this,6,7]皇帝陛下客气了。",
        "\t[图毅,E828]\b[this,6,4]嘿嘿。",
        "\t[芹宣,N466]\b[this,6,7]不过，陛下可能忘了，当今世上最强的势力是光明神殿，而不是你东凌皇室。",
        "\t[图毅,E828]\b[this,6,4]大长老此言，图毅惶恐。",
        "\t[芹宣,N466]\b[this,6,7]惶恐？光明神殿两位长老陨落在东凌帝国的莫析家族，据圣子所述，北寒帝国与东凌帝国边境的冲突，东凌帝国并没有派大军前去支援，反倒是派了一个叫东方溪的大将军，杀害了不少莫析家族的人。",
        "\t[图毅,E828]\b[this,6,4]圣子殿下，绝无此事啊，那东方溪早已不是东凌帝国的大将了，他的行为与皇室并无关系！",
        "\t[莫析辉,hero]\b[hero]我不相信你！",
        "\t[凌依,N574]\b[this,8,8]再怎么说，陛下，莫析家族作为东凌帝国镇守北方的家族，陛下却没有派人前去支援，这难道不是陛下想要对付莫析家族？",
        "\t[图毅,E828]\b[this,6,4]东凌帝国确实没有支援莫析家族，但，这只是我东凌帝国的战略，只是为了更好的在与北寒帝国的斗争中取得优势，是利好百姓的。难道圣子殿下认为我等要因为救莫析家族而置整个帝国的百姓于危难之中？",
        "\t[莫析辉,hero]\b[hero]这……图毅，我没有说要置整个东凌帝国的百姓于危难，你不要乱扣帽子。两个帝国的摩擦，死去一些人是难免的，这一次，死去的却是整个莫析家族的人，几乎没有活口，什么样的冲突竟然到了这种地步！",
        "\t[莫析辉,hero]\b[hero]你们灭了我满门，我一定要讨个公道！还有，二长老和七长老前去调查，他们只是去救人，总和两大帝国的冲突没有关系吧，我不相信区区一个北寒皇室就能拿下两位长老。",
        "\t[图毅,E828]\b[this,6,4]圣子殿下，我以图蒙氏一族起誓，绝没有对二长老、七长老、莫析家族家族下手！",
        "\t[葛尔丹,N566]\b[this,5,8]圣子弟弟，咱不可胡乱揣测，先找到证据，再来不迟。",
        "\t[图毅,E828]\b[this,6,4]葛圣子说的有理，还望几位给我一点时间，我两天之内一定查明这件事。",
        "\t[芹宣,N466]\b[this,6,7]是应该查个明白，好叭，暂且给你两天时间。",
        "\t[图毅,E828]\b[this,6,4]我为各位准备了旅馆，请各位在旅馆将就几天。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "DL3",
            "loc": [
                6,
                4
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "DL1",
            "loc": [
                6,
                2
            ]
        },
        "10,1": {
            "floorId": "DL3",
            "loc": [
                6,
                12
            ]
        },
        "6,0": {
            "floorId": "DL4",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [90707,90722,90693,90722,90722,90387, 91,90389,90722,90722,90693,90722,90707],
    [90707,  0,  0,  0,  0,90395,  0,90397,  0,  0, 91,  0,90707],
    [90707,  0,  0,  0,1096,  0,  0,  0,1096,  0,  0,  0,90707],
    [90707,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90707],
    [90707,  0,  0,  0,  0,  0,828,  0,  0,  0,  0,  0,90707],
    [90707,  0,90015,442,  0,  0,  0,  0,  0,441,90015,  0,90707],
    [90707,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90707],
    [90707,  0,  0,  0,  0,  0,535,  0,  0,  0,  0,  0,90707],
    [90707,  0,  0,  0,  0,569,  0,  0,  0,  0,  0,  0,90707],
    [90707,  0,90015,442,581,  0,  0,  0,577,441,90015,  0,90707],
    [90707,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90707],
    [90707,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90707],
    [90707,90709,90709,90709,90709,90709, 91,90709,90709,90709,90709,90709,90707]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,90388,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,90007,  0,  0,  0,  0,  0,  0,  0,90007,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,90007,  0,  0,  0,  0,  0,  0,  0,90007,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}