main.floors.DL4=
{
    "floorId": "DL4",
    "title": "东凌帝国 4 ",
    "name": "东凌帝国4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X20061",
    "bgm": "jw.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            "\t[莫析辉,hero]\b[hero]默默？你怎么也在这里，你也跟来啦？",
            "\t[默默,N481]\b[this]是的呢，圣子哥哥的家族损失惨重，默默想着，圣子哥哥一定需要帮助，所以带着夜馨公会的人一起过来了。",
            "\t[莫析辉,hero]\b[hero]谢谢你，默默。不过，你能拿到这里的情报么？",
            "\t[默默,N481]\b[this]为了圣子哥哥，我会努力的。",
            "\t[莫析辉,hero]\b[hero]对了，你刚刚看到一个蒙面人过去没？咦，你受伤了？",
            "\t[默默,N481]\b[this]看到了，那个蒙面人就往东凌皇宫去了，我就路过，被他打了一掌，呜呜呜……",
            "\t[莫析辉,hero]\b[hero]你实力不错啊，那个蒙面人在大长老手里过了两招，你竟然能从他手里逃脱没受伤。",
            "\t[默默,N481]\b[this]光明神殿的大长老么？看来那个蒙面人是受了重伤呢！不过默默也在蒙面人手里受了伤，后面的事，就交给铁姝姐姐帮你吧！",
            "\t[莫析辉,hero]\b[hero]好，谢了。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "DL2",
            "loc": [
                6,
                0
            ]
        },
        "0,6": {
            "floorId": "DL5",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049],
    [50049,777, 81,  0,  0, 81,614,50049,685, 28, 22,778,50049],
    [50049,  0,50049,780,780,50049,  0,50049,50049,50049,50049, 81,50049],
    [50049,684,50049,684,684,50049,778, 81,777,684,684,684,50049],
    [50049, 81,50049,684,684,50049,  0,50049,50049,50049,50049,50049,50049],
    [50049,778,50049,50049,50049,50049, 29,50049,  0,  0,781,684,50049],
    [ 92, 21,779,685,342,779,  0,50049, 27, 28,50049,  0,50049],
    [50049,50049,50049,50049,50049,50049,778,50049,685,344,50049,777,50049],
    [50049,684,  0,  0,778,684,  0,50049,50049,50049,50049, 81,50049],
    [50049,50049, 82,50049,50049,  0,777, 81,780, 21,684, 21,50049],
    [50049,  0,779,  0,50049,50049,481,50049,50049,50049,50049,50049,50049],
    [50049, 27,  0, 30,50049,686,  0, 21, 82,685,685,685,50049],
    [50049,50049,50049,50049,50049,50049, 91,50049,50049,50049,50049,50049,50049]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        6,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}