main.floors.GM5=
{
    "floorId": "GM5",
    "title": "长老会",
    "name": "长老会",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X30023",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": [
            "\t[芹萱,N466]\b[this]小圣子有什么事吗？",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "9,2": [
            "光明大陆最强二十八大家族（登场的16家族）。\n光明教皇南荒洛析家族。大长老东凌芹梦家族。\n二长老东凌安南家族。三长老北寒沂蒙家族。\n四长老西武枯云家族。五长老北寒冷霜家族。\n六长老南荒司默家族。七长老东凌温明家族。\n光明圣子东凌莫析家族。光明圣女北寒北纳家族。\n东凌皇室图蒙家族。北寒皇室希雅家族。\n南荒皇室童氏家族。西武皇室栗柴家族。\n黑暗圣子西武墨氏家族，水之圣子南荒江雨家族。"
        ],
        "2,11": [
            {
                "type": "confirm",
                "text": "确认要打开这个宝箱吗?",
                "yes": [
                    {
                        "type": "if",
                        "condition": "(status:mana<50)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "操作失败"
                            },
                            "你的魔力不足!"
                        ],
                        "false": [
                            {
                                "type": "setValue",
                                "name": "status:mana",
                                "operator": "-=",
                                "value": "50"
                            },
                            {
                                "type": "playSound",
                                "name": "door.mp3"
                            },
                            {
                                "type": "setBlock",
                                "number": "X10111"
                            },
                            "获得5点护盾",
                            {
                                "type": "setValue",
                                "name": "status:mdef",
                                "operator": "+=",
                                "value": "5"
                            }
                        ]
                    }
                ],
                "no": []
            }
        ],
        "10,11": [
            {
                "type": "confirm",
                "text": "确认要打开这个宝箱吗?",
                "yes": [
                    {
                        "type": "if",
                        "condition": "(status:mana<50)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "操作失败"
                            },
                            "你的魔力不足!"
                        ],
                        "false": [
                            {
                                "type": "setValue",
                                "name": "status:mana",
                                "operator": "-=",
                                "value": "50"
                            },
                            {
                                "type": "playSound",
                                "name": "door.mp3"
                            },
                            {
                                "type": "setBlock",
                                "number": "X10111"
                            },
                            "获得一把蓝钥匙",
                            {
                                "type": "setValue",
                                "name": "item:blueKey",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    }
                ],
                "no": []
            }
        ],
        "8,5": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "\t[安南奎,N546]\b[this]小圣子，我们在开会，有空再陪你玩啊！",
                    {
                        "type": "turnBlock",
                        "direction": "left"
                    },
                    {
                        "type": "comment",
                        "text": "下一条指令可视情况使用或不使用"
                    }
                ],
                "false": [
                    "\t[安南奎,N546]\b[this]小圣子，快来快来，给你个好东西",
                    {
                        "type": "setValue",
                        "name": "item:I635",
                        "operator": "+=",
                        "value": "1"
                    },
                    "\t[莫析辉,hero]\b[hero]这啥啊？",
                    "\t[安南奎,N546]\b[this]总之是好东西，保护你的，嘿嘿",
                    "\t[莫析辉,hero]\b[hero]谢谢二长老啦",
                    "\t[安南奎,N546]\b[this]小圣子真乖",
                    {
                        "type": "turnBlock",
                        "direction": "left"
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ],
        "4,9": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "\t[温明啸,N550]\b[this]辉儿，我们在开会，有空再来陪你啊！",
                    {
                        "type": "turnBlock",
                        "direction": "right"
                    },
                    {
                        "type": "comment",
                        "text": "下一条指令可视情况使用或不使用"
                    }
                ],
                "false": [
                    "\t[温明啸,N550]\b[this]辉，快过来，看我给你带来了啥好东西！",
                    {
                        "type": "setValue",
                        "name": "item:I416",
                        "operator": "+=",
                        "value": "1"
                    },
                    "\t[莫析辉,hero]\b[hero]这是什么啊？",
                    "\t[温明啸,N550]\b[this]这是能让人瞬间回满状态的至宝，玉露。你收好了，要是遇到了困难，用它能救自己一命呢！",
                    {
                        "type": "turnBlock",
                        "direction": "right"
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ],
        "4,5": [
            "\t[沂蒙贤,N570]一边去，别烦我。",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "4,7": [
            "\t[冷霜迪,N657]\b[this]一边去，别烦我。",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "8,9": [
            "\t[司默缇,N653]\b[this]小圣子，有什么事吗？",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "8,7": [
            "\t[枯云窦,N669]\b[this]小圣子，有什么事吗？",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "GM2",
            "loc": [
                1,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049],
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049],
    [50049,50165,20486,20487,  0,  0,50071,  0,  0,20502,20503,50165,50049],
    [50049,  0,  0,  0,  0,  0,466,  0,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,50088,50089,50090,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,572,50096,50097,50098,547,  0,  0,  0,50049],
    [ 92,  0,  0,  0,  0,50096,50097,50098,  0,  0,  0,  0, 92],
    [50049,  0,  0,  0,659,50096,50097,50098,670,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,50096,50097,50098,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,552,50096,50097,50098,654,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,50104,50105,50106,  0,  0,  0,  0,50049],
    [50049,50165,10110,  0,  0,  0,  0,  0,  0,  0,10110,50165,50049],
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,50006,50007,  0,50124,  0,50006,50007,  0,  0,  0],
    [  0,50157,20478,20479,50015,  0,50132,  0,50014,20494,20495,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,41754,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,50103,41664,50103,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,41696,41755,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,50103,41699,50103,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,41685,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,50103,  0,50103,  0,  0,  0,  0,  0],
    [  0,50157,  0,  0,  0,  0,  0,  0,  0,  0,  0,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50079,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,50078,  0,  0,  0,  0,  0,50078,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,50078,  0,  0,  0,  0,  0,50078,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,50078,  0,  0,  0,  0,  0,50078,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}