main.floors.GM8=
{
    "floorId": "GM8",
    "title": "准圣子宫",
    "name": "准圣子宫",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X30057",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "up"
        },
        {
            "type": "jumpHero",
            "loc": [
                6,
                11
            ],
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:6",
                "left:2"
            ]
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[莫析辉,hero]\b[hero]三长老、五长老、准圣子哥哥、圣女姐姐，不知有何事找我呀？",
        "\t[冷霜迪,N657]\b[this,8,9]把人带上来！",
        {
            "type": "setBlock",
            "number": "N435",
            "loc": [
                [
                    6,
                    9
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N443",
            "loc": [
                [
                    5,
                    10
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N443",
            "loc": [
                [
                    7,
                    10
                ]
            ]
        },
        "\t[光明骑士,N440]\b[this,5,10]去！",
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                6,
                9
            ]
        },
        {
            "type": "jump",
            "from": [
                6,
                9
            ],
            "to": [
                6,
                6
            ],
            "time": 500,
            "keep": true
        },
        "\t[蝶影,N432]\b[this,6,6]啊！",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    10
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    10
                ]
            ],
            "remove": true
        },
        "\t[沂蒙贤,N570]\b[this,8,7]哼！蝶影。",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        "\t[蝶影,N432]\b[this,6,6]三长老，我是衷心于圣女殿下的。",
        "\t[莫析辉,hero]\b[hero]三长老、五长老，你们这是在演哪出呀？",
        "\t[冷霜迪,N657]\b[this,8,9]圣子殿下不知道，此贱婢心不在圣女这里。平日可没少帮助外人，这样的人，如何留得？",
        {
            "type": "choices",
            "text": "\t[莫析辉,hero]选择",
            "choices": [
                {
                    "text": "帮蝶影说话",
                    "action": [
                        "\t[莫析辉,hero]\b[hero]哈哈，蝶影姑娘平日对圣女姐姐恭恭敬敬，又温和守礼，怎么会是这种人呢？",
                        "葛尔丹认为你体恤下人，亲密度+1。蜜西娅认为蝶影是你的人，亲密度-1。",
                        {
                            "type": "setValue",
                            "name": "flag:zhunshengzi",
                            "operator": "+=",
                            "value": "1"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:guangmingshengnv",
                            "operator": "-=",
                            "value": "1"
                        },
                        "\t[沂蒙贤,N570]\b[this,8,7]圣子殿下此言差矣。此贱婢平时没少干背叛圣女的事，今天难道圣子觉得背叛者不应该被处决吗？"
                    ]
                },
                {
                    "text": "与我无关",
                    "action": [
                        "\t[莫析辉,hero]\b[hero]呵呵，蝶影是圣女的人，你们想怎么处置就怎么处置，还把我和准圣子哥哥一起叫来看做什么，真是的，下回我处决下人也叫几位来看？",
                        "葛尔丹认为你冷漠无情，亲密度-1。蜜西娅认为蝶影不是你指示的，亲密度+1。",
                        {
                            "type": "setValue",
                            "name": "flag:zhunshengzi",
                            "operator": "-=",
                            "value": "1"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:guangmingshengnv",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        },
        "\t[蜜西娅,N489]\b[this,8,5]二位长老，蝶影是我的婢女，她平日做事勤恳，跟了我多年。只是一点小事，就暂且饶恕她吧，我会好好管教她的。",
        "\t[冷霜迪,N657]\b[this,8,9]圣女，这个贱婢背叛了你，怎么能留在这里？她可不止做了表面这些事，来人啊，把她拖下去！",
        "\t[蝶影,N432]\b[this,6,6]圣女殿下！圣女殿下！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true
        },
        "\t[葛尔丹,N566]\b[this,6,2]够了，蜜西娅，沂蒙贤，冷霜迪，你们都给我出去！在我的宫里处决婢女，是想干什么？我定会找教皇爷爷理论一番的！都给我出去！",
        "\t[沂蒙贤,N570]\b[this,8,7]二位殿下，我们只是给二位看看这种不忠的人的下场，没别的意思。哈哈，圣女，咱们走吧！",
        "\t[蜜西娅,N489]\b[this,8,5]蝶影……",
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    4
                ]
            ],
            "floorId": "SN10",
            "remove": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playBgm",
            "name": "shenqu.mp3"
        },
        "\t[蝶影,N432]我，蝶影，是安南奎的养女，安南静。",
        "\t[蝶影,N432]我记得，很小的时候，我的亲生父亲曾是东凌帝国的小军官，母亲是军队的女医。",
        "\t[蝶影,N432]每天，我都爱坐在屋檐下，静静地等待着爸爸妈妈的归来。",
        "\t[蝶影,N432]爸爸每次都会给我带来我最爱的糖葫芦，甜甜的，我十分喜欢。妈妈会给我编制最美的麻花辫，戴着青色的发绳，很是美丽。",
        "\t[蝶影,N432]东凌帝国与北寒帝国的摩擦源源不断，他们总是很忙。有时候，我也恨他们，为什么不能多陪陪自己。",
        "\t[蝶影,N432]他们总是很晚才回来，带回我最爱的糖葫芦，然后，我会开心地去迎接他们。可是那天，夕阳染红了夜晚的天空，他们也不曾回来，直到星辰闪烁，寒月来临，他们也不曾回来……",
        "\t[蝶影,N432]我在屋檐等待了一个晚上，只能不断地念叨着爸妈快些回来。",
        "\t[蝶影,N432]很久以后，我的养父安南奎才找到我，带来了爸爸妈妈战死的消息。战场瞬息万变，北寒帝国突然降临的埋伏，让爸爸所在的军队遭到了重创。",
        "\t[蝶影,N432]为了救下爸爸，妈妈随着援军连日奔波，却也是徒劳，最终成为了北寒帝国的俘虏。",
        "\t[蝶影,N432]养父带我来到边境之时，看到的是母亲破碎的身体。想哭就哭吧，静儿。养父如是说道。我望着北面那片土地，心中只有无数的恨意。",
        "\t[蝶影,N432]养父说，我们一切都要以家族为重。以后，你便叫蝶影吧！",
        "\t[蝶影,N432]蝶影，像蝴蝶一般翩翩起舞么？我何曾像蝴蝶一般翩翩起舞，一切，只为了家族而已。",
        "\t[蝶影,N432]我要效忠的人，是莫析家那个金发的小男孩。但我却被送到了圣女的身边。经过养父的调教，圣女对我很是满意。",
        "\t[蝶影,N432]圣女是一个善良的人，她愿意帮助那些穷苦的百姓，对我也很好。如果，她不是家族的敌人，那该多好。",
        "\t[蝶影,N432]圣子，我要效忠的小男孩，每次都会给予我一个温暖的微笑。我相信，他将来会是家族最英明的领导，也会是最好的教皇陛下……",
        "\t[蝶影,N432]三长老是一个精明的人，每时每刻，我都感觉他能一眼看穿自己。也许，有一天我将暴露……不知道，还会有人记得我的付出么……",
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "GM3",
            "loc": [
                6,
                2
            ]
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "setBlock",
            "number": "N549",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "setBlock",
            "number": "N553",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[安南奎,N546]\b[this,5,6]什么？竟有此事？",
        "\t[莫析辉,hero]\b[hero]是的，蜜西娅竟然当着我和葛尔丹的面处决了她的婢女。她什么意思？难道认为蝶影是我的人？",
        "\t[温明啸,N550]\b[this,7,6]……",
        "\t[温明啸,N550]\b[this,7,6]小圣子，蝶影确实是我们的人……",
        "\t[莫析辉,hero]\b[hero]温明叔叔！蝶影姑娘是……",
        "\t[温明啸,N550]\b[this,7,6]蝶影确实是我们安插在蜜茜娅身边的人。",
        "\t[莫析辉,hero]\b[hero]难怪蝶影姑娘对我那么好……",
        "\t[温明啸,N550]\b[this,7,6]不止如此，蝶影还将沂蒙、冷霜和北纳家族的不少情报告诉了我们，也算是死得其所了。",
        "\t[莫析辉,hero]\b[hero]死得其所？温明叔叔，蝶影姑娘可是为了我们而死啊！您怎么……",
        "\t[安南奎,N546]\b[this,5,6]辉儿，蝶影是沂蒙贤和冷霜迪处死的，害死她的，是沂蒙家族和冷霜家族！",
        "\t[温明啸,N550]\b[this,7,6]对。辉儿，成为光明教皇的路，没有那么好走，没有这些人为家族的铺路，如何能顺利成为光明教皇？",
        "\t[莫析辉,hero]\b[hero]难道成为教皇，就要牺牲别人的性命吗？",
        "\t[温明啸,N550]\b[this,7,6]辉儿，以后你会明白的。以前的教皇之争，甚至还有圣子圣女背后的家族被灭，一旦背后的家族被灭了，那所谓的圣子圣女，也就如无根的浮萍一般了。",
        "\t[安南奎,N546]\b[this,5,6]你看那葛尔丹，背后没有任何家族，今天蜜茜娅就敢带着三长老和五长老去他的宫里处决婢女。",
        "\t[安南奎,N546]\b[this,5,6]对了，我听说，你身边也有蜜西娅的内奸……",
        "\t[莫析辉,hero]\b[hero]啊？没有啊，怎么会呢？安南伯伯听谁说的呀？",
        "\t[安南奎,N546]\b[this,5,6]听谁说的不重要，但我观察他很久了，你的守护骑士罗涛，与沂蒙贤有过几次交流，他出生自南荒帝国，与蜜西娅的未婚夫，南荒帝国二皇子也有过联系，想必错不了。",
        "\t[莫析辉,hero]\b[hero]罗涛跟了我这么久，没有功劳也有苦劳。安南伯伯，放过他吧？",
        "\t[安南奎,N546]\b[this,5,6]放过他？哼，你可知道，他把莫析家族不少重要的情报都交给了蜜西娅？放过他，谁来放过莫析家族？",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[安南奎,N546]\b[this,5,6]罗涛！",
        {
            "type": "setBlock",
            "number": "N585",
            "loc": [
                [
                    6,
                    11
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "move",
            "loc": [
                6,
                11
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up:3"
            ]
        },
        "\t[罗涛,N582]\b[this,6,8]二长老！",
        "\t[安南奎,N546]\b[this,5,6]我有一些上好的修炼材料要给圣子殿下，你跟我去领一下吧！",
        "\t[罗涛,N582]\b[this,6,8]是！",
        "\t[莫析辉,hero]\b[hero]罗涛！",
        "\t[罗涛,N582]\b[this,6,8]圣子殿下？",
        "\t[莫析辉,hero]\b[hero]没事……",
        "\t[罗涛,N582]\b[this,6,8]那属下告退了……",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[安南奎,N546]\b[this,5,6]辉儿，我为你重新找一个守护骑士。",
        "\t[莫析辉,hero]\b[hero]不用了，安南伯伯，我与骑士队的凌依有过几面之缘，他来自西武帝国，应该不会有什么问题。",
        "\t[安南奎,N546]\b[this,5,6]那好。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "setValue",
            "name": "flag:luotao",
            "value": "1"
        },
        "次日，光明圣子的守护骑士罗涛筋脉寸断，倒在圣女宫门口……",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playBgm",
            "name": "shenqu.mp3"
        },
        "\t[罗涛,N582]\b[this,6,8]什么是光明？",
        "\t[罗涛,N582]\b[this,6,8]母亲告诉我，光明，是从内心散发出的正义和勇气，是坚定不移的信念和追求。它照亮前行的道路，让人们在黑暗中找到希望和勇气，永远不要放弃对光明的追求。",
        "\t[罗涛,N582]\b[this,6,8]我来自一个单亲家庭，很久以前，爹与娘有了一夜情，便有了我。可惜，娘并不是爹所爱，不久后，爹便抛下了娘，与他的真爱远走高飞。",
        "\t[罗涛,N582]\b[this,6,8]娘，含辛茹苦将我养大，早已病痛缠身。",
        "\t[罗涛,N582]\b[this,6,8]我的武艺一向不错，运气也不差，遇到了我人生中的贵人，沂蒙贤。也就是光明神殿的三长老。",
        "\t[罗涛,N582]\b[this,6,8]三长老将娘的病痛治好，还让我进入了光明神殿，这个传说中大陆最强的势力，我成为了一名光明骑士。",
        "\t[罗涛,N582]\b[this,6,8]光明骑士，我拥有了光明的未来。我可以让娘过上好日子了，我真的很开心，娘辛苦了一辈子，我终于可以给娘最好的一切了。",
        "\t[罗涛,N582]\b[this,6,8]我在光明神殿努力向上，只为了让娘过得更好一些。那天，我拿了光明骑士比武的第一名，第一名的奖励是什么？成为下一任骑士队长？还是获得大量的赏金？",
        "\t[罗涛,N582]\b[this,6,8]新的光明圣子恰好在此刻出现了，教皇陛下亲自将我指给了圣子殿下，让我成为了一名守护骑士。",
        "\t[罗涛,N582]\b[this,6,8]守护骑士，我太高兴了，我成为了光明神殿少有的守护骑士。我以为，我会就此过上幸福的一生。",
        "\t[罗涛,N582]\b[this,6,8]当三长老沂蒙贤找到我时，我感到心中的天崩塌了。什么是光明？这就是光明吗？当昔日的贵人与如今的主子成为敌对，我该怎么选择？",
        "\t[罗涛,N582]\b[this,6,8]圣子殿下亲和待人，我不想，也不愿做此不忠之事。\n不会伤害到你家圣子的，三长老笑眯眯地对我说道，他拿出了一个瓶子，这里面的东西，给你家圣子倒上一点，就没事了。",
        "\t[罗涛,N582]\b[this,6,8]真的要这么做吗？我如是想道。\n想想你的母亲，沂蒙贤对着我微微一笑。看着他老谋深算的样子，我知道，自己已经无路可走。",
        "\t[罗涛,N582]\b[this,6,8]葛尔丹，之前的光明圣子，现在的准圣子，他总是笑眯眯地盯着我，仿佛什么都知道。",
        "\t[罗涛,N582]\b[this,6,8]啊，圣子殿下，我无路可走，无路可退。当二长老带我走进他的住处时，我便眼前一黑。娘，我不能再为您尽孝了……",
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "N577",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[凌依,N574]\b[this,6,6]守护骑士凌依，拜见圣子殿下！",
        "\t[莫析辉,hero]\b[hero]好，凌依，咱们有缘，想不到这么快，你就成为了我的守护骑士。",
        "\t[凌依,N574]\b[this,6,6]凌依必不负圣子殿下。圣子殿下，圣女派人来找你去圣女宫了。",
        "\t[莫析辉,hero]\b[hero]哼，好。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,3": [
            "\t[卢轩,N578]\b[this]守护骑士卢轩，永远忠于葛尔丹殿下！"
        ],
        "8,3": [
            {
                "type": "if",
                "condition": "(flag:zhunhan===1)",
                "true": [
                    "\t[准涵,N436]\b[this]圣子殿下，我儿怎么样了？",
                    "\t[莫析辉,hero]\b[hero]......",
                    "\t[准涵,N436]\b[this]为何不说话？殿下！",
                    "\t[莫析辉,hero]\b[hero]准涵，不好意思，你的儿子已经……",
                    "\t[准涵,N436]\b[this]……",
                    "\t[准涵,N436]\b[this]不！我的儿啊！我的儿啊！",
                    "\t[莫析辉,hero]\b[hero]准涵！",
                    "\t[准涵,N436]\b[this]对不起，殿下，我失态了……多谢殿下帮我打听，这瓶琼浆就当作谢礼吧。",
                    {
                        "type": "setValue",
                        "name": "item:I415",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                8,
                                3
                            ]
                        ],
                        "remove": true
                    },
                    "准涵病倒了，人也越来越憔悴，不久之后，便已卧床不起，几个月之后，终于撒手人寰，离开了这个世界……",
                    {
                        "type": "setCurtain",
                        "color": [
                            0,
                            0,
                            0,
                            1
                        ],
                        "time": 500,
                        "keep": true
                    },
                    {
                        "type": "playBgm",
                        "name": "shenqu.mp3"
                    },
                    "\t[准涵,N436]一天，两天，三天……",
                    "\t[准涵,N436]我是准涵，度过了平凡的一生。曾经，我是温明家族的佣人。",
                    "\t[准涵,N436]温明家族很大，很大，高高的墙外，是什么？我时常想去墙外的世界看一看。",
                    "\t[准涵,N436]我的父母，也是温明家的仆人，他们安稳地走完了这一生。可惜，他们从来没有离开过温明家。",
                    "\t[准涵,N436]一天，两天，三天……我想要去外面的世界看一看。我数着日子过，也不知道过了多少个日夜，直到我与温明家族的仆人成婚，生下了我的儿子，也不曾离开这个高楼。",
                    "\t[准涵,N436]光明神殿派来了一波人，说是要招光明骑士。我的儿子，天资聪颖，一眼便被送入了光明神殿，成为了一名优秀的光明骑士。",
                    "\t[准涵,N436]没想到，我一辈子的仆人，还能生下一位光明骑士。我有幸随着我的儿子来到了光明神殿，这是我一辈子不曾见过的富丽堂皇。",
                    "\t[准涵,N436]我的儿子，早早的通过了光明骑士的试炼，便被派到了莫析家族去驻守。也好，莫析家族，是当今二十八大家族之一，一般没什么危险的。",
                    "\t[准涵,N436]七长老，温明啸很是大方地让我留在光明神殿，因我做的了一手好饭，便成为了光明神殿的厨娘。",
                    "\t[准涵,N436]也许，一辈子就这么平平淡淡的过去了吧，我如是想道。我的儿子也时常与我写信。妈，你的身体还好吗？要注意身体啊！儿啊，妈很好，你也要注意身体啊！",
                    "\t[准涵,N436]物是人非事事休，欲语泪先流。我有太多的话，太多的思念，想与我儿诉说，却不知从何说起。每次见面，却又无法说起。",
                    "\t[准涵,N436]准涵，这是你儿子的信。七长老向我递过来那封我期盼已久的信。光明神殿新来了一位圣子，你要不要去做他的侍女？",
                    "\t[准涵,N436]圣子？自教皇陛下登基以来，还没有圣子圣女，没想到我竟然有荣幸成为光明圣子——下一任教皇的侍女。",
                    "\t[准涵,N436]圣子殿下，葛尔丹，是一位勤奋的殿下，他也来自平民，天赋极好，对百姓也十分温和。我想，他便是最好的圣子殿下了吧。",
                    "\t[准涵,N436]曾经的圣子殿下，总是挂着甜甜的笑容，享受着光明神殿的一切，几位长老都奉承着他。他与我儿是那么的像，就像天之骄子一般。我们无话不谈。",
                    "\t[准涵,N436]圣女只比他小了一岁，但天赋却比圣子殿下强了不少。那天，奉承殿下的长老们，全部都围绕在圣女身边，人人看到的是殿下脸上挂着的笑容，我却能感受到殿下的落寞。",
                    "\t[准涵,N436]卢轩，与我一样早早便跟随了圣子殿下。却在圣女殿下来临之后，与殿下疏远了。谁也不能理解圣子殿下心中的苦，脸上却依然要保持着假笑。",
                    "\t[准涵,N436]准涵，以后看着点葛尔丹。七长老对我如是说道。为什么？七长老。我不解地问道。七长老道，以后，你效忠的，是莫析家族的小圣子。",
                    "\t[准涵,N436]我心中无比冰凉。我与殿下，最终也要走到这一步么？我与殿下一样，更恨教皇陛下褫夺殿下的圣子之位。说是“准圣子”，可谁又知道殿下的委屈？",
                    "\t[准涵,N436]殿下终究是与我生分了。他与卢轩讨论怎么对付莫析家族，与我讨论如何针对北纳家族。一切的一切，我都知道。",
                    "\t[准涵,N436]殿下与我的儿子，都是我最重要的人，如今却成为了二选一的选择题。忠于殿下？忠于温明家族？我不愿选择！",
                    "\t[准涵,N436]当我看到蝶影和罗涛的下场后，心如死灰。这也是我的下场么……我只想与我的儿子平平淡淡的过完这一生，我不想伤害任何人，为什么就这么难？",
                    "\t[准涵,N436]准涵，卢轩，我知道你们是莫析辉和蜜西娅的人。殿下如是说道。\n终于要来了么，最终，我还是要与殿下撕破脸面吗？",
                    "\t[准涵,N436]我静静地等待着殿下的处置，也许，我的一生就要这么结束了吧。只是我还想再见见我的儿子……\n蝶影和罗涛，我不想害死他们的。殿下难过的说着。谁曾想，莫析家族和北纳家族的少爷小姐，这么狠。",
                    "\t[准涵,N436]是啊，二长老、三长老、五长老、七长老，对待叛徒可不狠吗？\n你们还要留在我身边么？殿下说着，我知道，你们的家人一定被他们挟持着。我可以放弃与他们争斗。",
                    "\t[准涵,N436]殿下说道，准涵和卢轩是他身边最重要的人了，像家人一样，如果不能保护好，那争斗那些有什么用呢？\n殿下如此，夫复何求？我们于殿下是家人，殿下于我们，又何尝不是家人？我们当然忠于殿下！",
                    "\t[准涵,N436]我只是一个平凡的人，我只想好好的活着。本以为一切都向好的方向发展时，却不料东凌帝国与北寒帝国的一场战争，便夺走了我的儿子性命。天命不公，为何我如此苦难！",
                    {
                        "type": "setCurtain",
                        "time": 500
                    }
                ],
                "false": [
                    "\t[准涵,N436]\b[this]愿为葛尔丹殿下赴汤蹈火！"
                ]
            }
        ],
        "7,11": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "7,12": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "5,11": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "5,12": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "6,2": [
            "\t[葛尔丹,N566]\b[this]光明在我心！"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "GM1",
            "loc": [
                0,
                3
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,  0],
    [30734,50049,50049,50049,50049,50049,50071,50049,50049,50049,50049,50049,30767],
    [30734,50167,102467,102468,  0,  0,566,  0,  0,102467,102468,50167,30767],
    [  0,  0,102475,102476,578,  0,  0,  0,436,102475,102476,  0,  0],
    [50100,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [50100,  0,50165,50094,  0,  0,  0,  0,490,50095,50165,  0,50100],
    [50100,584,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [50100,  0,50165,50094,  0,  0,  0,  0,571,50095,50165,  0,50100],
    [50100,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [  0,  0,50165,50094,  0,  0,  0,  0,658,50095,50165,  0,  0],
    [30734,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30767],
    [30734,  0,  0,  0,  0,442,  0,441,  0,  0,  0,  0,30767],
    [  0,50164,50164,50164,50164,442, 91,441,50164,50164,50164,50164,  0]
],
    "bgmap": [
    [30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234],
    [30234,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30234],
    [30234,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30234],
    [30234,  0,110216,110217,110218,110219,110220,110221,110222,110223,110288,  0,30234],
    [30234,  0,110224,110225,110226,110227,110228,110229,110230,110231,110296,  0,30234],
    [30234,  0,110232,110233,110234,110235,110236,110237,110238,110239,110304,  0,30234],
    [30234,  0,110240,110241,110242,110243,110244,110245,110246,110247,110312,  0,30234],
    [30234,  0,110248,110249,110250,110251,110252,110253,110254,110255,110320,  0,30234],
    [30234,  0,110256,110257,110258,110259,110260,110261,110262,110263,110328,  0,30234],
    [30234,  0,110264,110265,110266,110267,110268,110269,110270,110271,110336,  0,30234],
    [30234,  0,110272,110273,110274,110275,110276,110277,110278,110279,110344,  0,30234],
    [30234,  0,110280,110281,110282,110283,110284,110285,110286,110287,110352,  0,30234],
    [30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234]
],
    "fgmap": [
    [30726,  0,50006,50007,20584,  0,20598,  0,20584,50006,50007,  0,30759],
    [30726,50159,50014,50015,20592,  0,  0,  0,20592,50014,50015,50159,30759],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [30726,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30759],
    [30726,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30759],
    [  0,50156,50156,50156,50156,  0,  0,  0,50156,50156,50156,50156,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50049,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50079,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,102459,102460,  0,  0,  0,  0,  0,102459,102460,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "flyPoint": [
        6,
        12
    ]
}