main.floors.GM8=
{
    "floorId": "GM8",
    "title": "准圣子宫",
    "name": "准圣子宫",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X30057",
    "bgm": "mingyunshouhu.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "up"
        },
        {
            "type": "jumpHero",
            "loc": [
                6,
                11
            ],
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:6",
                "left:2"
            ]
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[莫析辉,hero]\b[hero]三长老、五长老、准圣子哥哥、圣女姐姐，不知有何事找我呀？",
        "\t[冷霜迪,N657]\b[this,8,9]把人带上来！",
        {
            "type": "setBlock",
            "number": "N435",
            "loc": [
                [
                    6,
                    9
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N443",
            "loc": [
                [
                    5,
                    10
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N443",
            "loc": [
                [
                    7,
                    10
                ]
            ]
        },
        "\t[光明骑士,N440]\b[this,5,10]去！",
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                6,
                9
            ]
        },
        {
            "type": "jump",
            "from": [
                6,
                9
            ],
            "to": [
                6,
                6
            ],
            "time": 500,
            "keep": true
        },
        "\t[蝶影,N432]\b[this,6,6]啊！",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    10
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    10
                ]
            ],
            "remove": true
        },
        "\t[沂蒙贤,N570]\b[this,8,7]哼！蝶影。",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        "\t[蝶影,N432]\b[this,6,6]三长老，我是衷心于圣女殿下的。",
        "\t[莫析辉,hero]\b[hero]三长老、五长老，你们这是在演哪出呀？",
        "\t[冷霜迪,N657]\b[this,8,9]圣子殿下不知道，此贱婢心不在圣女这里。平日可没少帮助外人，这样的人，如何留得？",
        {
            "type": "choices",
            "text": "\t[莫析辉,hero]选择",
            "choices": [
                {
                    "text": "帮蝶影说话",
                    "action": [
                        "\t[莫析辉,hero]\b[hero]哈哈，蝶影姑娘平日对圣女姐姐恭恭敬敬，又温和守礼，怎么会是这种人呢？",
                        "葛尔丹认为你体恤下人，亲密度+1。蜜西娅认为蝶影是你的人，亲密度-1。",
                        {
                            "type": "setValue",
                            "name": "flag:zhunshengzi",
                            "operator": "+=",
                            "value": "1"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:guangmingshengnv",
                            "operator": "-=",
                            "value": "1"
                        },
                        "\t[沂蒙贤,N570]\b[this,8,7]圣子殿下此言差矣。此贱婢平时没少干背叛圣女的事，今天难道圣子觉得背叛者不应该被处决吗？"
                    ]
                },
                {
                    "text": "与我无关",
                    "action": [
                        "\t[莫析辉,hero]\b[hero]呵呵，蝶影是圣女的人，你们想怎么处置就怎么处置，还把我和准圣子哥哥一起叫来看做什么，真是的，下回我处决下人也叫几位来看？",
                        "葛尔丹认为你冷漠无情，亲密度-1。蜜西娅认为蝶影不是你指示的，亲密度+1。",
                        {
                            "type": "setValue",
                            "name": "flag:zhunshengzi",
                            "operator": "-=",
                            "value": "1"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:guangmingshengnv",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        },
        "\t[蜜西娅,N489]\b[this,8,5]二位长老，蝶影是我的婢女，她平日做事勤恳，跟了我多年。只是一点小事，就暂且饶恕她吧，我会好好管教她的。",
        "\t[冷霜迪,N657]\b[this,8,9]圣女，这个贱婢背叛了你，怎么能留在这里？她可不止做了表面这些事，来人啊，把她拖下去！",
        "\t[蝶影,N432]\b[this,6,6]圣女殿下！圣女殿下！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true
        },
        "\t[葛尔丹,N566]\b[this,6,2]够了，蜜西娅，沂蒙贤，冷霜迪，你们都给我出去！在我的宫里处决婢女，是想干什么？我定会找教皇爷爷理论一番的！都给我出去！",
        "\t[沂蒙贤,N570]\b[this,8,7]二位殿下，我们只是给二位看看这种不忠的人的下场，没别的意思。哈哈，圣女，咱们走吧！",
        "\t[蜜西娅,N489]\b[this,8,5]蝶影……",
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    4
                ]
            ],
            "floorId": "SN10",
            "remove": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "GM3",
            "loc": [
                6,
                2
            ]
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "setBlock",
            "number": "N549",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "setBlock",
            "number": "N553",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[安南奎,N546]\b[this,5,6]什么？竟有此事？",
        "\t[莫析辉,hero]\b[hero]是的，蜜西娅竟然当着我和葛尔丹的面处决了她的婢女。她什么意思？难道认为蝶影是我的人？",
        "\t[温明啸,N550]\b[this,7,6]……",
        "\t[温明啸,N550]\b[this,7,6]小圣子，蝶影确实是我们的人……",
        "\t[莫析辉,hero]\b[hero]温明叔叔！蝶影姑娘是……",
        "\t[温明啸,N550]\b[this,7,6]蝶影确实是我们安插在蜜茜娅身边的人。",
        "\t[莫析辉,hero]\b[hero]难怪蝶影姑娘对我那么好……",
        "\t[温明啸,N550]\b[this,7,6]不止如此，蝶影还将沂蒙、冷霜和北纳家族的不少情报告诉了我们，也算是死得其所了。",
        "\t[莫析辉,hero]\b[hero]死得其所？温明叔叔，蝶影姑娘可是为了我们而死啊！您怎么……",
        "\t[安南奎,N546]\b[this,5,6]辉儿，蝶影是沂蒙贤和冷霜迪处死的，害死她的，是沂蒙家族和冷霜家族！",
        "\t[温明啸,N550]\b[this,7,6]对。辉儿，成为光明教皇的路，没有那么好走，没有这些人为家族的铺路，如何能顺利成为光明教皇？",
        "\t[莫析辉,hero]\b[hero]难道成为教皇，就要牺牲别人的性命吗？",
        "\t[温明啸,N550]\b[this,7,6]辉儿，以后你会明白的。以前的教皇之争，甚至还有圣子圣女背后的家族被灭，一旦背后的家族被灭了，那所谓的圣子圣女，也就如无根的浮萍一般了。",
        "\t[安南奎,N546]\b[this,5,6]你看那葛尔丹，背后没有任何家族，今天蜜茜娅就敢带着三长老和五长老去他的宫里处决婢女。",
        "\t[安南奎,N546]\b[this,5,6]对了，我听说，你身边也有蜜西娅的内奸……",
        "\t[莫析辉,hero]\b[hero]啊？没有啊，怎么会呢？安南伯伯听谁说的呀？",
        "\t[安南奎,N546]\b[this,5,6]听谁说的不重要，但我观察他很久了，你的守护骑士罗涛，与沂蒙贤有过几次交流，他出生自南荒帝国，与蜜西娅的未婚夫，南荒帝国二皇子也有过联系，想必错不了。",
        "\t[莫析辉,hero]\b[hero]罗涛跟了我这么久，没有功劳也有苦劳。安南伯伯，放过他吧？",
        "\t[安南奎,N546]\b[this,5,6]放过他？哼，你可知道，他把莫析家族不少重要的情报都交给了蜜西娅？放过他，谁来放过莫析家族？",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[安南奎,N546]\b[this,5,6]罗涛！",
        {
            "type": "setBlock",
            "number": "N585",
            "loc": [
                [
                    6,
                    11
                ]
            ],
            "floorId": "GM3"
        },
        {
            "type": "move",
            "loc": [
                6,
                11
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up:3"
            ]
        },
        "\t[罗涛,N582]\b[this,6,8]二长老！",
        "\t[安南奎,N546]\b[this,5,6]我有一些上好的修炼材料要给圣子殿下，你跟我去领一下吧！",
        "\t[罗涛,N582]\b[this,6,8]是！",
        "\t[莫析辉,hero]\b[hero]罗涛！",
        "\t[罗涛,N582]\b[this,6,8]圣子殿下？",
        "\t[莫析辉,hero]\b[hero]没事……",
        "\t[罗涛,N582]\b[this,6,8]那属下告退了……",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[安南奎,N546]\b[this,5,6]辉儿，我为你重新找一个守护骑士。",
        "\t[莫析辉,hero]\b[hero]不用了，安南伯伯，我与骑士队的凌依有过几面之缘，他来自西武帝国，应该不会有什么问题。",
        "\t[安南奎,N546]\b[this,5,6]那好。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "floorId": "GM3",
            "remove": true
        },
        {
            "type": "setValue",
            "name": "flag:luotao",
            "value": "1"
        },
        "次日，光明圣子的守护骑士罗涛筋脉寸断，倒在圣女宫门口……",
        {
            "type": "setBlock",
            "number": "N577",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "floorId": "GM3"
        },
        "\t[凌依,N574]\b[this,6,6]守护骑士凌依，拜见圣子殿下！",
        "\t[莫析辉,hero]\b[hero]好，凌依，咱们有缘，想不到这么快，你就成为了我的守护骑士。",
        "\t[凌依,N574]\b[this,6,6]凌依必不负圣子殿下。圣子殿下，圣女派人来找你去圣女宫了。",
        "\t[莫析辉,hero]\b[hero]哼，好。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "floorId": "GM3",
            "remove": true
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,3": [
            "\t[卢轩,N578]\b[this]守护骑士卢轩，永远忠于葛尔丹殿下！"
        ],
        "8,3": [
            {
                "type": "if",
                "condition": "(flag:zhunhan===1)",
                "true": [
                    "\t[准涵,N436]\b[this]圣子殿下，我儿怎么样了？",
                    "\t[莫析辉,hero]\b[hero]......",
                    "\t[准涵,N436]\b[this]为何不说话？殿下！",
                    "\t[莫析辉,hero]\b[hero]准涵，不好意思，你的儿子已经……",
                    "\t[准涵,N436]\b[this]……",
                    "\t[准涵,N436]\b[this]不！我的儿啊！我的儿啊！",
                    "\t[莫析辉,hero]\b[hero]准涵！",
                    "\t[准涵,N436]\b[this]对不起，殿下，我失态了……多谢殿下帮我打听，这瓶琼浆就当作谢礼吧。",
                    {
                        "type": "setValue",
                        "name": "item:I415",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                8,
                                3
                            ]
                        ],
                        "remove": true
                    },
                    "准涵病倒了，人也越来越憔悴，不久之后，便已卧床不起，几个月之后，终于撒手人寰，离开了这个世界……"
                ],
                "false": [
                    "\t[准涵,N436]\b[this]愿为葛尔丹殿下赴汤蹈火！"
                ]
            }
        ],
        "7,11": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "7,12": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "5,11": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "5,12": [
            "\t[光明骑士,N440]\b[this]为光明而战！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "6,2": [
            "\t[葛尔丹,N566]\b[this]光明在我心！"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "GM1",
            "loc": [
                0,
                3
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,  0],
    [30734,50049,50049,50049,50049,50049,50071,50049,50049,50049,50049,50049,30767],
    [30734,50167,102467,102468,  0,  0,566,  0,  0,102467,102468,50167,30767],
    [  0,  0,102475,102476,578,  0,  0,  0,436,102475,102476,  0,  0],
    [50100,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [50100,  0,50165,50094,  0,  0,  0,  0,490,50095,50165,  0,50100],
    [50100,584,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [50100,  0,50165,50094,  0,  0,  0,  0,571,50095,50165,  0,50100],
    [50100,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50100],
    [  0,  0,50165,50094,  0,  0,  0,  0,658,50095,50165,  0,  0],
    [30734,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30767],
    [30734,  0,  0,  0,  0,442,  0,441,  0,  0,  0,  0,30767],
    [  0,50164,50164,50164,50164,442, 91,441,50164,50164,50164,50164,  0]
],
    "bgmap": [
    [30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234],
    [30234,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30234],
    [30234,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30234],
    [30234,  0,110216,110217,110218,110219,110220,110221,110222,110223,110288,  0,30234],
    [30234,  0,110224,110225,110226,110227,110228,110229,110230,110231,110296,  0,30234],
    [30234,  0,110232,110233,110234,110235,110236,110237,110238,110239,110304,  0,30234],
    [30234,  0,110240,110241,110242,110243,110244,110245,110246,110247,110312,  0,30234],
    [30234,  0,110248,110249,110250,110251,110252,110253,110254,110255,110320,  0,30234],
    [30234,  0,110256,110257,110258,110259,110260,110261,110262,110263,110328,  0,30234],
    [30234,  0,110264,110265,110266,110267,110268,110269,110270,110271,110336,  0,30234],
    [30234,  0,110272,110273,110274,110275,110276,110277,110278,110279,110344,  0,30234],
    [30234,  0,110280,110281,110282,110283,110284,110285,110286,110287,110352,  0,30234],
    [30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234,30234]
],
    "fgmap": [
    [30726,  0,50006,50007,20584,  0,20598,  0,20584,50006,50007,  0,30759],
    [30726,50159,50014,50015,20592,  0,  0,  0,20592,50014,50015,50159,30759],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50157,50086,  0,  0,  0,  0,  0,50087,50157,  0,  0],
    [30726,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30759],
    [30726,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30759],
    [  0,50156,50156,50156,50156,  0,  0,  0,50156,50156,50156,50156,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50049,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50079,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,102459,102460,  0,  0,  0,  0,  0,102459,102460,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "flyPoint": [
        6,
        12
    ]
}