main.floors.HA18=
{
    "floorId": "HA18",
    "title": "黑暗神殿 9 ",
    "name": "黑暗神殿9",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X140137",
    "bgm": "gentaiyangxishuozaijian.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,9": [
            "未完待续……",
            {
                "type": "choices",
                "text": "\t[莫析辉,hero]是否提交成绩？",
                "choices": [
                    {
                        "text": "是",
                        "action": [
                            {
                                "type": "unloadEquip",
                                "pos": 0
                            },
                            {
                                "type": "unloadEquip",
                                "pos": 1
                            },
                            {
                                "type": "unloadEquip",
                                "pos": 2
                            },
                            {
                                "type": "unloadEquip",
                                "pos": 3
                            },
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "value": "status:atk+status:def"
                            },
                            {
                                "type": "if",
                                "condition": "flag:heianshengzi",
                                "true": [
                                    {
                                        "type": "win",
                                        "reason": "吴璋达"
                                    }
                                ],
                                "false": [
                                    {
                                        "type": "win",
                                        "reason": "苗健壮"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "text": "否",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "HA2",
            "loc": [
                0,
                6
            ]
        },
        "0,6": {
            "floorId": "HA19",
            "loc": [
                12,
                6
            ]
        },
        "6,0": {
            "floorId": "HA20",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140166,140166,140166,140166,140166,140166, 91,140166,140166,140166,140166,140166,140166],
    [140166,352,1024,687,140166,  0,  0,687, 22,140166,  0, 21,140166],
    [140166,140166, 81,140166,140166, 83,140166,140166,140166,140166,687,  0,140166],
    [140166,687,  0,  0, 21,769,  0,140166, 21,140166,140166,1022,140166],
    [140166,  0,877,140166,140166,140166, 81,140166,  0,140166,  0,  0,140166],
    [140166, 21,  0,  0,140166,1117,  0,1021,  0,140166,687,  0,140166],
    [ 92,877,140166,140166,140166,140166,140166, 81,140166,140166,  0,1022, 92],
    [140166,  0,  0, 22,140166,688,  0,737,  0,  0, 21,  0,140166],
    [1095,140166, 82,140166,140166,140166,140166,140166, 82,140166,140166,140166,140166],
    [104,1077,1024,  0,349,687,140166,  0,737,  0,618,687,140166],
    [1095,140166, 81,140166,140166,140166,140166, 81,140166, 81,140166,140166,140166],
    [140166,688,  0,  0, 21,  0,1024,  0,140166,852, 22,687,140166],
    [140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        12,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}