main.floors.HA4=
{
    "floorId": "HA4",
    "title": "黑暗神殿供奉台",
    "name": "黑暗神殿供奉台",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X140137",
    "bgm": "gentaiyangxishuozaijian.mp3",
    "firstArrive": [],
    "eachArrive": null,
    "parallelDo": "",
    "events": {
        "6,6": [
            {
                "type": "if",
                "condition": "(flag:heianshengzi===1)",
                "true": [
                    "\t[莫析辉,hero]咦，这里有一个珠子",
                    "\t[墨奈,N1124]那是黑暗之神与黑暗神殿之人交流的神器",
                    "\t[墨奈,N1124]黑暗圣子墨奈，求见黑暗之神！",
                    {
                        "type": "vibrate",
                        "direction": "horizontal",
                        "time": 2000,
                        "speed": 10,
                        "power": 10
                    },
                    {
                        "type": "screenFlash",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "time": 500,
                        "times": 1
                    },
                    "\t[??]墨奈！吾之孩子！",
                    "\t[??]这是……好强的光明气息！你是光明神殿的！",
                    "\t[墨奈,N1124]黑暗之神……他是我的本体……",
                    "\t[??]本体?",
                    "一束光照向光明圣子莫析辉，莫析辉只感到一种可怕的力量注视着自己，随时可以置自己于死地，好在那股力量并没有针对于他，很快便移开了",
                    "\t[??]果真如此，墨奈！吾观你如今是灵魂状态，怕是离不开本体了，是什么人杀害了你！",
                    "\t[墨奈,N1124]黑暗之神，杀我者，正是黑暗圣女黛莫琳。",
                    {
                        "type": "vibrate",
                        "direction": "diagonal1",
                        "time": 2000,
                        "speed": 10,
                        "power": 10
                    },
                    "\t[??]可恶！这个贱婢，竟敢加害于你！",
                    "\t[莫析辉,hero]墨奈，为什么你们一个是黑暗圣子，一个是黑暗圣女，黑暗之神如此偏爱你?莫不是黑暗之神重男轻女?",
                    "\t[墨奈,N1124]不是，因为我长得像黑暗之神成神之前的儿子……",
                    "\t[莫析辉,hero]啊?",
                    "\t[??]光明圣子，你长得像本座成神之前的儿子，你的分身墨奈更是像极了他……如果你能时常来黑暗神殿，本座欢迎之至！",
                    "\t[莫析辉,hero]多谢黑暗之神",
                    "\t[??]可惜，你不信奉黑暗之神，不然本座可以用信仰给你提升实力的……不过看在墨奈的份上，本座给你提供一点实力吧",
                    {
                        "type": "setValue",
                        "name": "status:atk",
                        "operator": "+=",
                        "value": "5000"
                    },
                    {
                        "type": "setValue",
                        "name": "status:def",
                        "operator": "+=",
                        "value": "5000"
                    },
                    {
                        "type": "setValue",
                        "name": "status:mdef",
                        "operator": "+=",
                        "value": "5000"
                    },
                    {
                        "type": "playSound",
                        "name": "回血"
                    },
                    "\r[yellow]全属性提升50000\r[]",
                    "\t[莫析辉,hero]多谢黑暗之神",
                    "\t[墨奈,N1124]莫析辉，我有一个事情，不知道该不该说",
                    "\t[莫析辉,hero]你我一体，有什么不能说的。",
                    "\t[墨奈,N1124]\r[yellow]之前我向你和光明圣女挑战，发生了一件事。那便是有另外的蒙面人袭击了我的守护骑士林霄！\r[]",
                    "\t[莫析辉,hero]那有什么?",
                    "\t[墨奈,N1124]\r[yellow]那场战斗可远不止表面上那么简单，表面上是你和北纳蜜西娅与我的战斗，背后恐怕还有黑暗圣女\r[]、\r[red]甚至光明神殿其他势力\r[]插手",
                    "\t[莫析辉,hero]你是说……\r[red]光明神殿有黑暗圣女黛莫琳的人！\r[]",
                    "\t[墨奈,N1124]你多加小心！",
                    "\t[莫析辉,hero]好！",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ],
                "false": []
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "HA2",
            "loc": [
                3,
                2
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,30941,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30943,  0,  0,  0,  0,  0,30938,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30936,  0,  0,  0,140277,  0,  0,  0,30942,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30940,  0,  0,  0,  0,  0,30939,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,30782,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 85,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,41727, 91,41727,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036],
    [42036,42060,42060,42060,42060,42060,42060,42060,42060,42060,42060,42060,42036],
    [42036,42060,42036,42036,42036,42036,42036,42036,42036,42036,42036,42060,42036],
    [42036,42060,42036,42036,42036,42036,42036,42036,42036,42036,42036,42060,42036],
    [42036,42060,42036,42036,42152,42153,42154,42155,42156,42036,42036,42060,42036],
    [42036,42060,42036,42036,42160,42161,42162,42163,42164,42036,42036,42060,42036],
    [42036,42060,42036,42036,42168,42169,42170,42171,42172,42036,42036,42060,42036],
    [42036,42060,42036,42036,42176,42177,42178,42179,42180,42036,42036,42060,42036],
    [42036,42060,42036,42036,42184,42185,42186,42187,42188,42036,42036,42060,42036],
    [42036,42060,42036,42036,42036,42036,42036,42036,42036,42036,42036,42060,42036],
    [42036,42060,42036,42036,42036,42036,42036,42036,42036,42036,42036,42060,42036],
    [42036,42060,42060,42060,42060,42060,42060,42060,42060,42060,42060,42060,42036],
    [42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036,42036]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,30925,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30927,  0,  0,30933,  0,  0,30922,  0,  0,  0],
    [  0,  0,  0,30935,  0,  0,  0,  0,  0,30930,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30920,  0,  0,  0,  0,  0,  0,  0,30926,  0,  0],
    [  0,  0,30928,  0,  0,  0,  0,  0,  0,  0,30934,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30924,  0,  0,  0,  0,  0,30923,  0,  0,  0],
    [  0,  0,  0,30932,  0,  0,30766,  0,  0,30931,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,30774,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,41711,  0,41711,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,41719,  0,41719,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "color": null,
    "flyPoint": [
        6,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}