main.floors.HA6=
{
    "floorId": "HA6",
    "title": "黑暗神殿 2",
    "name": "黑暗神殿2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X140137",
    "bgm": "gentaiyangxishuozaijian.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,7": [
            "\t[莫析辉,hero]\b[hero]嗨，你好呀",
            "\t[黑暗骑士,N1123]\b[this]你好啊，咦，你长得和圣子殿下好像唉",
            "\t[莫析辉,hero]\b[hero]这黑暗神殿乌漆麻黑的，真是不好走啊",
            "\t[黑暗骑士,N1123]\b[this]习惯就好，这是专门针对光明神殿的，要是光明神殿的人过来啊，会被黑暗之神的力量压制得完全看不见",
            "\t[莫析辉,hero]\b[hero]这样啊，那幸好我看得见",
            "\t[黑暗骑士,N1123]\b[this]听说我们的圣子殿下是被光明圣子和光明圣女联手偷袭杀害了，我们在练兵，迟早得打到光明神殿，摘了光明圣子脑袋当球踢，把光明圣女凌辱百遍！",
            "\t[莫析辉,hero]\b[hero]我tm……嘿嘿，怎么会是偷袭呢，光明神殿两个圣子圣女会打不过黑暗神殿一个圣子吗",
            "\t[黑暗骑士,N1123]\b[this]这你就不知道了，咱们圣子占据了黑暗神殿大部分资源，岂是那废物光明圣子和光明圣女能比的。",
            "\t[黑暗骑士,N1123]\b[this]若不是光明神殿以二打一，还从背后偷袭，我们圣子怎会陨落",
            "\t[莫析辉,hero]\b[hero]哦哦，你先走吧，我先缓缓",
            "\t[黑暗骑士,N1123]\b[this]你先缓一缓也好，到时候可要为圣子殿下报仇",
            {
                "type": "hide",
                "remove": true
            },
            "\t[莫析辉,hero]\b[hero]好个黑暗神殿，真是胡说八道，我明明白白正面打败了墨奈，也没有杀死他，怎么就变成我们二打一还偷袭，还杀死他了……"
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "HA2",
            "loc": [
                12,
                6
            ]
        },
        "12,6": {
            "floorId": "HA7",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "8,5": [
            {
                "type": "setValue",
                "name": "flag:door_HA6_9_6",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,7": [
            {
                "type": "setValue",
                "name": "flag:door_HA6_9_6",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "9,6": {
            "0": {
                "condition": "flag:door_HA6_9_6==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_HA6_9_6",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166],
    [140166, 21,  0, 21, 81,1021,140165,349,  0,140166,688,  0,140166],
    [140166,  0,688,  0,140166,  0,140166,  0,853, 81,  0,687,140166],
    [140166,140166, 82,140166,140166,687,140166,617,  0,140166,348,  0,140166],
    [140166,  0,852,  0,140166,  0,140166,1021,  0,140166,140166,140166,140166],
    [140166,140166, 81,140166,140166, 21,140166,  0,1023,140166,  0,  0,140166],
    [ 94,  0,  0,140167,140166,  0,140166,  0,  0, 85,  0,1022, 94],
    [140166,140166,851,140175,140166,  0,140166,  0,1023,140166,1123,  0,140166],
    [140166,934,  0,  0, 81,  0,140166,  0,  0,140166,140166,140166,140166],
    [140166, 81,140166,140166,140166,1024,140166,  0,876, 81,  0,688,140166],
    [140166,349,140166,687,  0,617,140166,1022,  0,140166, 21,  0,140166],
    [140166,618,140166,  0,352,  0,140165,  0, 21,140166,  0,1117,140166],
    [140166,140166,140166,140171,140166,140166,140166,140166,140166,140166,140166,140166,140166]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        0,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}