main.floors.HA6=
{
    "floorId": "HA6",
    "title": "黑暗神殿 2",
    "name": "黑暗神殿2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "X140137",
    "bgm": "gentaiyangxishuozaijian.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,6": {
            "floorId": "HA2",
            "loc": [
                12,
                6
            ]
        },
        "12,6": {
            "floorId": "HA7",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "8,5": [
            {
                "type": "setValue",
                "name": "flag:door_HA6_9_6",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,7": [
            {
                "type": "setValue",
                "name": "flag:door_HA6_9_6",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "9,6": {
            "0": {
                "condition": "flag:door_HA6_9_6==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_HA6_9_6",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166,140166],
    [140166, 21,  0, 21, 81,1021,140165,349,  0,140166,688,  0,140166],
    [140166,  0,688,  0,140166,  0,140166,  0,853, 81,  0,687,140166],
    [140166,140166, 82,140166,140166,687,140166,617,  0,140166,348,  0,140166],
    [140166,  0,852,  0,140166,  0,140166,1021,  0,140166,140166,140166,140166],
    [140166,140166, 81,140166,140166, 21,140166,  0,1023,140166,  0,  0,140166],
    [ 94,  0,  0,140167,140166,  0,140166,  0,  0, 85,  0,1022, 94],
    [140166,140166,851,140175,140166,  0,140166,  0,1023,140166,485,  0,140166],
    [140166,934,  0,  0, 81,  0,140166,  0,  0,140166,140166,140166,140166],
    [140166, 81,140166,140166,140166,1024,140166,  0,876, 81,  0,688,140166],
    [140166,349,140166,687,  0,617,140166,1022,  0,140166, 21,  0,140166],
    [140166,618,140166,  0,352,  0,140165,  0, 21,140166,  0,1117,140166],
    [140166,140166,140166,140171,140166,140166,140166,140166,140166,140166,140166,140166,140166]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        0,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}