main.floors.LZ1=
{
    "floorId": "LZ1",
    "title": "龙族 1 ",
    "name": "龙族1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "grass",
    "bgm": "bgm.mp3",
    "firstArrive": [
        "龙族剧情按照与圣骑士亲密度极好情况进行（亲密度不够依旧按照亲密度达到进行），玩法还是按照实际亲密度进行（亲密度不够不会额外获得帮助）。",
        "因圣骑士唐佳成的感应，光明圣子莫析辉与圣骑士二人来到了龙族，这块神秘的，远离光明神殿的岛屿……"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "LZ2",
            "loc": [
                6,
                12
            ]
        },
        "12,6": {
            "floorId": "HA18",
            "loc": [
                0,
                9
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,688,  0,824,347,  0,1131,  0,346,823,  0,688,140],
    [140, 81,140,140,140,140, 83,140,140,140,140, 82,140],
    [140,1131,140,703,703,140,1029,140,618,618,140,823,140],
    [140,  0,140,703,823, 81,  0,140,618,825,140,  0,140],
    [140,352,140,140,140,140,352,140,140, 81,140, 21,140],
    [140,  0,140,689,  0,1029, 81,824,  0,689,140,  0, 92],
    [140,825,140,140, 81,140,823,140,140,140,140,1029,140],
    [140,  0,140, 21,1131,140,  0,140, 21, 21,140,  0,140],
    [140,346,140,353,356,140,689, 81,1132, 21,140,347,140],
    [140,  0,140,140,140,140,140,140,140,140,140,  0,140],
    [140,1131,  0,688,  0,824,  0,1029, 81,688,  0,823,140],
    [140,140,140,140,140,140, 93,140,140,140,140,140,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}