main.floors.MM3=
{
    "floorId": "MM3",
    "title": " 3 ",
    "name": "3",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10025",
    "bgm": "mingzhentankenanlansegubao.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[???,N497]\b[this,6,8]大人。",
        "\t[???,N493]\b[this,6,4]混账！",
        "\t[???,N497]\b[this,6,8]这都是蜜西娅这个贱人的错，一边与光明圣子联手，一边背后捅刀子……",
        "\t[???,N493]\b[this,6,4]真的吗？我知道你对光明神殿有多恨，你不会是想先除了光明圣子和光明圣女吧？",
        "\t[???,N497]\b[this,6,8]大人……",
        "\t[???,N493]\b[this,6,4]你坏了我的大事！墨奈比光明圣子和光明圣女更难对付，不除掉墨奈，我哪有出头之日！混账东西！还不快想办法救出他！",
        "\t[???,N497]\b[this,6,8]是！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "XW1",
            "loc": [
                9,
                6
            ],
            "direction": "right"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041],
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,493,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,500,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041,10041],
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041],
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}