main.floors.MM6=
{
    "floorId": "MM6",
    "title": " 6 ",
    "name": "6",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X140137",
    "bgm": "gentaiyangxishuozaijian.mp3",
    "firstArrive": [
        "\t[林霄,N485]\b[this,6,4]黛默琳！",
        "\t[黛默琳,N481]\b[this,6,8]林霄，方才，有人看见你勾结光明圣子进入黑暗神殿。说吧，光明圣子在哪里呀？",
        "\t[林霄,N485]\b[this,6,4]我不知道！",
        "\t[黛默琳,N481]\b[this,6,8]林霄哥哥，可不是妹妹不帮你呀。本来看在你是圣子哥哥的守护骑士份上，小妹不曾为难你，结果你非要与光明神殿的圣子勾结，祸害黑暗神殿，小妹不得不处置你，以正黑暗神殿纲纪！",
        "\t[林霄,N485]\b[this,6,4]哈哈哈哈哈哈！啊哈哈哈哈！",
        "\t[林霄,N485]\b[this,6,4]黛默琳，别以为我不知道，黑暗圣子殿下就是被你所害！你暗地里派了多少人来追杀我，以为我不知道吗？",
        "\t[黛默琳,N481]\b[this,6,8]各位，这林霄身为守护骑士，杀死了自己守护的圣子，我身为圣女，自然要为圣子报仇。没想到，这林霄竟然倒打一耙，反倒怪人家杀害了圣子哥哥了。真是其心当诛啊！",
        "\t[林霄,N485]\b[this,6,4]好啊，黛默琳，你还往我头上扣屎盆子！",
        "\t[黛默琳,N481]\b[this,6,8]罢了，林霄哥哥，这周围可都是小妹的人呢！只是你知道的实在太多了，不然这样吧，你只要效忠于我，我便让你继续拥有守护骑士的地位，回到黑暗神殿，如何？",
        "\t[林霄,N485]\b[this,6,4]不可能！我这一生，只效忠于圣子殿下！黛默琳，你杀害了圣子殿下，还想让我效忠于你，绝无可能！",
        "\t[黛默琳,N481]\b[this,6,8]既然如此，各位，给林霄哥哥来一个痛快的吧！",
        "\t[林霄,N485]\b[this,6,4]等一下！",
        "\t[黛默琳,N481]\b[this,6,8]怎么？怕了？",
        "\t[林霄,N485]\b[this,6,4]哈哈哈哈！怕？我林霄纵横多年，还不知道怕字怎么写呢！",
        "\t[林霄,N485]\b[this,6,4]告诉你，他们还不配杀我！我自己来！",
        {
            "type": "jump",
            "from": [
                6,
                4
            ],
            "to": [
                6,
                7
            ],
            "time": 500,
            "keep": true
        },
        "\t[林霄,N485]\b[this,6,7]去死吧黛默琳！我要拉你去见圣子殿下，给圣子殿下赔罪吧！",
        {
            "type": "animate",
            "name": "baofa",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "animate",
            "name": "dazhaofadong",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "animate",
            "name": "explosion_small",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "animate",
            "name": "hongguang",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "animate",
            "name": "lvup",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "animate",
            "name": "sword5_1",
            "loc": [
                6,
                7
            ]
        },
        "\t[黛默琳,N481]\b[this,6,8]你找死！",
        {
            "type": "animate",
            "name": "zhuanhua",
            "loc": [
                6,
                7
            ]
        },
        "\t[林霄,N485]\b[this,6,7]啊啊啊啊啊啊！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "remove": true
        },
        "\t[铁姝,npc0]\b[this,7,9]林霄……",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[林霄,N485]一切都结束了吗？",
        "\t[林霄,N485]好想回家……",
        "\t[林霄,N485]我从小就被养在了黑暗神殿，无父也无母。黑暗神殿便是我的家，我的父母。",
        "\t[林霄,N485]黑暗神殿，一个被光明神殿驱逐之地。我的命运，被掌握在四位长老手中。",
        "\t[林霄,N485]我对黑暗神殿来说，是无数从小养大的孩子。但黑暗神殿对我来说，是唯一的父母，是唯一的家。从小长老就教导我，我将来要效忠于黑暗神殿，效忠于圣子殿下。",
        "\t[林霄,N485]圣子殿下？比我还小的那个孩子，我成为了他的守护骑士。人生来就是不平等的，墨奈殿下，刚出现，便是黑暗神殿的焦点，哪怕耀眼如圣女，也不得不避其锋芒，而我，不过是黑暗神殿的一滩淤泥。",
        "\t[林霄,N485]有时候，我总在想，为什么我努力半生，才成为黑暗圣子的守护骑士，为什么你不用努力，就成为了黑暗圣子。",
        "\t[林霄,N485]墨奈的天赋很高，又有黑暗神殿的资源倾斜，不过几年实力便已经超越了我，成为下一任教皇，是板上钉钉的事情了，我规规矩矩的，在黑暗神殿也将有一个好的归宿。",
        "\t[林霄,N485]哪怕强如黑暗圣子，也有畏惧别人的时候。墨奈，他畏惧那个比他还弱的光明圣子。不要去招惹光明神殿，我不止一次阻止这位自负的圣子殿下，都是徒劳……",
        "\t[林霄,N485]令我震惊的是，黑暗圣子竟然是光明圣子十几年前剥离的黑暗部分。墨奈殿下如愿以偿地抓到了自己的本体，希望能够解除与本体的束缚。可世事难料，光明圣子被擒的事，很快被教皇陛下所知，墨奈殿下只得把光明圣子放走，最终败在光明圣子与光明圣女的联手之下。",
        "\t[林霄,N485]我曾经想过，我到底是忠于圣子，还是忠于黑暗神殿？或许，我是忠于黑暗神殿的吧……那一天，圣子陨落了，我也回不去了。忠心了一辈子，最后黑暗神殿却传来了“林霄背叛圣子”的传言。",
        "\t[林霄,N485]我对黑暗神殿的渴望，如同孩子想回到母亲的怀抱一般。我只是想回家，但家已经不容我……黑暗圣女的几次追杀，我终于明白了杀害圣子的幕后凶手，应该就是黛默琳！圣子殿下的灵魂并没有消散，被我用法阵保护了起来，趁着光明圣子来到西武帝国，我决定铤而走险……",
        "\t[林霄,N485]黑暗神殿的守护骑士与光明神殿的圣子走在了一起……这一切，都是为了你啊，圣子殿下……墨奈！我渴望的是，黑暗圣子能够在本体的帮助下，重新回归，我才能回到自己的家……",
        "\t[林霄,N485]黛默琳很快就找来了，最终，她给出了十分诱人的条件，回到黑暗神殿——回到家。多么诱人的条件啊！我以为我会像断线的风筝想找到自己的线，以为我会像无根的浮萍想找到自己的根，以为我会像离家的浪子想回到自己的家一样飞奔回去……没想到，我拒绝了黛默琳的提议。",
        "\t[林霄,N485]我在回家和圣子中，还是选择了圣子……家，我再也回不去了……墨奈，圣子，你欠了我好多好多啊……",
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "changeFloor",
            "floorId": "HA12"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019],
    [140019,  0,  0,140019,  0,  0,  0,  0,  0,  0,  0,  0,140019],
    [140019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,140019],
    [140019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,140019],
    [140019,140019,  0,  0,  0,  0,485,  0,  0,  0,  0,  0,140019],
    [140019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,140019,140019],
    [140019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,140019],
    [140019,1123,  0,  0,  0,  0,  0,  0,  0,  0,  0,1123,140019],
    [140019,  0,1123,  0,  0,  0,484,  0,  0,  0,1123,  0,140019],
    [140019,  0,  0,1123,  0,  0,  0,136,  0,1123,  0,  0,140019],
    [140019,140019,  0,  0,1123,1123,1123,1123,1123,  0,  0,140019,140019],
    [140019,140019,  0,  0,  0,  0,  0,  0,  0,  0,  0,140019,140019],
    [140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019,140019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}