main.floors.MT0=
{
    "floorId": "MT0",
    "title": "莫析 1",
    "name": "莫析家",
    "canFlyTo": false,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "X40099",
    "images": [],
    "ratio": 8,
    "map": [
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049],
    [50049,50049,50049,50049,50049,50049,50071,50049,50049,50049,50049,50049,50049],
    [50049,50165,  0,  0,  0,  0,562,  0,  0,  0,  0,50165,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,546,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,440,  0,  0,  0,  0,  0,  0,  0,  0,  0,440,50049],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 92],
    [50049,443,  0,  0,  0,  0,  0,  0,  0,  0,  0,443,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,50165,50164,50164,50164,442,  0,441,50164,50164,50164,50165,50049],
    [50049,50049,50049,50049,50049,50049, 91,50049,50049,50049,50049,50049,50049]
],
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:shengqishi",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:guangmingshengnv",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:zhunshengzi",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:heianshengzi",
            "value": "0"
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:5"
            ]
        },
        "\t[辉,hero]\b[hero]父亲，您找我？",
        "\t[莫析宙,N562]\b[this,6,2]辉，安南家族的奎伯伯来看你了。",
        "\t[辉,hero]\b[hero]奎伯伯？光明神殿二长老吗？上次见过您。",
        "\t[安南奎,N546]\b[this,8,3]哈哈，辉儿记忆真好，还记得我。",
        "\t[辉,hero]\b[hero]嘿嘿，奎伯伯。",
        "\t[安南奎,N546]\b[this,8,3]辉儿以后恐怕要改口，叫我二长老啦！",
        "\t[辉,hero]\b[hero]？？",
        "\t[莫析宙,N562]\b[this,6,2]是的，光明神殿发现你的光明属性极其罕见，准备让你去光明神殿接受光明神的洗礼，成为光明圣子。",
        "\t[辉,hero]\b[hero]啊，这……我能成为光明圣子？",
        "\t[安南奎,N546]\b[this,8,3]是的，辉儿，你的光明属性很强，我特地奉光明神的旨意，请你前往光明神殿。",
        "\t[莫析宙,N562]\b[this,6,2]孩子，你不要慌，安南家族的奎伯伯，还有温明家族的啸叔叔都和莫析家族交好，他们会帮助你的。",
        "\t[辉,hero]\b[hero]那好叭，伯伯，我们何时去光明神殿呢？",
        "\t[安南奎,N546]\b[this,8,3]今天就出发，你觉得怎么样？",
        "\t[辉,hero]\b[hero]行。",
        "\t[安南奎,N546]\b[this,8,3]那么，就跟伯伯走吧！",
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    3
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "GM1",
            "loc": [
                6,
                10
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "7,11": [
            "死去的光明骑士"
        ],
        "5,11": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "死去的光明骑士……"
                ],
                "false": [
                    "\t[光明骑士,N440]\b[this]莫析永存！",
                    "\t[莫析辉,hero]\b[hero]你还好吗？",
                    "\t[光明骑士,N440]\b[this]少主……",
                    "\t[莫析辉,hero]\b[hero]你是准涵的儿子？",
                    "\t[光明骑士,N440]\b[this]少主还记得我，属下死而无憾了。",
                    "\t[莫析辉,hero]\b[hero]你别动，我来给你疗伤！你千万别死啊！",
                    "\t[光明骑士,N440]\b[this]没用了，少主……咳咳……我已经是强弩之末了，能坚持到现在已经不行了……",
                    "\t[莫析辉,hero]\b[hero]可恶，告诉我，是什么人！告诉我啊！",
                    "\t[光明骑士,N440]\b[this]少主，我……我只知道，一个是北寒帝国的最强法师安撒，一个是东凌帝国的东方溪……",
                    "\t[莫析辉,hero]\b[hero]东凌帝国还出手了？可恶！",
                    "\t[光明骑士,N440]\b[this]是的，表面上是北寒帝国与东凌帝国的领土争端……实际上……咳咳……是北寒帝国与东凌帝国联手在坑害莫析家族、安南家族……咳咳，还有温明家族……",
                    "\t[莫析辉,hero]\b[hero]血海深仇，东凌皇帝真是活腻了！",
                    "\t[光明骑士,N440]\b[this]（闭眼）",
                    "\t[莫析辉,hero]\b[hero]不，不要啊！呜呜呜……我该怎么跟准涵说……我的家族，我的一切都没了……呜呜呜……",
                    {
                        "type": "setValue",
                        "name": "flag:zhunhan",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ],
        "11,5": [
            "死去的骑士……"
        ],
        "11,7": [
            "死去的骑士……"
        ],
        "1,5": [
            "死去的骑士……"
        ],
        "1,7": [
            "死去的骑士……"
        ],
        "3,1": [
            "小时候的自己。"
        ],
        "9,1": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [],
                "false": [
                    "\t[莫析辉,hero]\b[hero]小时候，我只知道另一个照片是我自己，这个和我相似的孩子，他是谁？可惜父亲和母亲都不曾告诉我……",
                    "\t[莫析辉,hero]\b[hero]难道我小时候真有一个夭折的孪生兄弟？黑暗圣子墨奈，莫非是我失散多年的孪生兄弟……",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "ZL10",
            "loc": [
                6,
                3
            ]
        },
        "12,6": {
            "floorId": "MT3",
            "loc": [
                0,
                6
            ]
        },
        "0,6": {
            "floorId": "MT4",
            "loc": [
                12,
                6
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50031,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50079,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,40504,40505,40505,40505,40506,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40520,40521,40521,40521,40522,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,41905,  0,  0,50023,  0,  0,41906,  0,  0,  0],
    [  0,50157,  0,41913,  0,  0,  0,  0,  0,41914,  0,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,50157,50156,50156,50156,  0,  0,  0,50156,50156,50156,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "bgm": "mingyunshouhu.mp3",
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,50078,  0,  0,  0,50078,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,50078,  0,  0,  0,50078,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}