main.floors.MT0=
{
    "floorId": "MT0",
    "title": "莫析 1",
    "name": "莫析家",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "X40099",
    "images": [],
    "ratio": 1,
    "map": [
    [50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049,50049],
    [50049,50049,50049,50049,50049,50049,50071,50049,50049,50049,50049,50049,50049],
    [50049,50165,  0,  0,  0,  0,562,  0,  0,  0,  0,50165,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,546,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,440,  0,  0,  0,  0,  0,  0,  0,  0,  0,440,50049],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [50049,443,  0,  0,  0,  0,  0,  0,  0,  0,  0,443,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50049],
    [50049,50165,50164,50164,50164,442,  0,441,50164,50164,50164,50165,50049],
    [50049,50049,50049,50049,50049,50049, 93,50049,50049,50049,50049,50049,50049]
],
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:shengqishi",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:guangmingshengnv",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:zhunshengzi",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:heianshengzi",
            "value": "0"
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:5"
            ]
        },
        "\t[辉,hero]\b[hero]父亲，您找我？",
        "\t[莫析宙,N562]\b[this,6,2]辉，安南家族的奎伯伯来看你了。",
        "\t[辉,hero]\b[hero]奎伯伯？光明神殿二长老吗？上次见过您。",
        "\t[安南奎,N546]\b[this,8,3]哈哈，辉儿记忆真好，还记得我。",
        "\t[辉,hero]\b[hero]嘿嘿，奎伯伯。",
        "\t[安南奎,N546]\b[this,8,3]辉儿以后恐怕要改口，叫我二长老啦！",
        "\t[辉,hero]\b[hero]？？",
        "\t[莫析宙,N562]\b[this,6,2]是的，光明神殿发现你的光明属性极其罕见，准备让你去光明神殿接受光明神的洗礼，成为光明圣子。",
        "\t[辉,hero]\b[hero]啊，这……我能成为光明圣子？",
        "\t[安南奎,N546]\b[this,8,3]是的，辉儿，你的光明属性很强，我特地奉光明神的旨意，请你前往光明神殿。",
        "\t[莫析宙,N562]\b[this,6,2]孩子，你不要慌，安南家族的奎伯伯，还有温明家族的啸叔叔都和莫析家族交好，他们会帮助你的。",
        "\t[辉,hero]\b[hero]那好叭，伯伯，我们何时去光明神殿呢？",
        "\t[安南奎,N546]\b[this,8,3]今天就出发，你觉得怎么样？",
        "\t[辉,hero]\b[hero]行。",
        "\t[安南奎,N546]\b[this,8,3]那么，就跟伯伯走吧！",
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    3
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "GM1",
            "loc": [
                6,
                10
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "7,11": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "5,11": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "11,5": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "11,7": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "up"
            }
        ],
        "1,5": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "1,7": [
            "\t[光明骑士,N440]\b[this]莫析永存！",
            {
                "type": "turnBlock",
                "direction": "up"
            }
        ],
        "1,6": [
            "\t[骑士,N440]\b[this]少爷，这里是莫析家族的重要基地，没有老爷的命令不能进去。",
            "\t[莫析辉,hero]\b[hero]本少爷就是看看而已啦!",
            {
                "type": "moveHero",
                "steps": [
                    "right:2"
                ]
            }
        ],
        "11,6": [
            "\t[骑士,N440]\b[this]少爷，这里是莫析家族的重要基地，没有老爷的命令不能进去。",
            "\t[莫析辉,hero]\b[hero]本少爷就是看看而已啦!",
            {
                "type": "moveHero",
                "steps": [
                    "left:2"
                ]
            }
        ],
        "6,2": [
            "\t[莫析宙,N562]\b[this]吾儿要好好努力啊！"
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50031,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,50079,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,40504,40505,40505,40505,40506,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40512,40513,40513,40513,40514,  0,  0,  0,  0],
    [  0,  0,  0,  0,40520,40521,40521,40521,40522,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,41905,  0,  0,50023,  0,  0,41906,  0,  0,  0],
    [  0,50157,  0,41913,  0,  0,  0,  0,  0,41914,  0,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,50157,50156,50156,50156,  0,  0,  0,50156,50156,50156,50157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "bgm": "mingyunshouhu.mp3",
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,50078,  0,  0,  0,50078,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,50078,  0,  0,  0,50078,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}