main.floors.MT1=
{
    "floorId": "MT1",
    "title": "莫析家族1 ",
    "name": "莫析家族1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "ground",
    "bgm": "21-30.mp3",
    "firstArrive": [
        "本区玩法：建议先偷宝库，再参加boss战"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            "\t[莫析辉,hero]\b[hero]默默？你怎么在这里呀？",
            "\t[默默,N481]\b[this]圣子哥哥，我本来是在东凌帝国招一些人进入夜馨公会的，听到莫析家族这边发生了事情，就顺便溜进来看看……",
            "\t[莫析辉,hero]\b[hero]这个地下通道，你也知道？",
            "\t[默默,N481]\b[this]圣子哥哥不要生气嘛，夜馨公会也是调查这件事……",
            "\t[莫析辉,hero]\b[hero]我倒是没有生气，只是没想到夜馨公会竟然有这么大的能力。只是不知道你调查到了一些什么呀，能不能分享给我看看？",
            "\t[默默,N481]\b[this]我调查到了什么？嘿嘿，哥哥不要急，我的朋友铁姝也在这里，你可以问问她，她的资料比较全哦。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "ZL10",
            "loc": [
                10,
                1
            ]
        },
        "0,6": {
            "floorId": "MT2",
            "loc": [
                12,
                6
            ]
        },
        "6,0": {
            "floorId": "MT8",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10041,10041,10041,10041,10041,10041, 91,10041,10041,10041,10041,10041,10041],
    [10041,690,10041,690,10041,703,  0,616,10041,690,10041,700,10041],
    [10041,604,10041,368,10041,  0,776,  0,10041,366,10041,363,10041],
    [10041, 21,10041,774,10041,10041, 83,10041,10041,772,10041, 21,10041],
    [10041,768,10041,  0,365,  0,768,  0, 81,  0,10041,768,10041],
    [10041, 81,10041,772,10041,10041,10041,10041,10041,774,10041, 81,10041],
    [ 92,772,10041,  0,10041,10041,10041,10041,10041,  0,10041,772,10041],
    [10041,  0,363,  0,774,  0,365,  0,768,  0,690,  0,10041],
    [10041,10041, 81,10041,10041,690,  0,700,10041,10041, 81,10041,10041],
    [10041,  0,768,  0,10041,10041,774,10041,10041,  0,772,  0,10041],
    [10041, 21, 22, 21,10041, 21,481, 22,10041,  0, 21,  0,10041],
    [10041, 21, 21, 21,10041,  0,  0,  0,10041, 21,691, 21,10041],
    [10041,10041,10041,10041,10041,10041, 91,10041,10041,10041,10041,10041,10041]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}