main.floors.MT10=
{
    "floorId": "MT10",
    "title": "莫析家族10 ",
    "name": "莫析家族10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "ground",
    "bgm": "21-30.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,4": [
            "\t[莫析辉,hero]\b[hero]温明叔叔！",
            "\t[温明啸,N550]\b[this]……",
            "\t[莫析辉,hero]\b[hero]温明叔叔！",
            "\t[温明啸,N550]\b[this]……",
            {
                "type": "animate",
                "name": "die",
                "loc": [
                    4,
                    4
                ]
            },
            {
                "type": "hide",
                "remove": true
            },
            "\t[莫析辉,hero]\b[hero]温明叔叔！不！"
        ],
        "10,4": [
            "\t[安南奎,N546]\b[this]辉儿……",
            "\t[莫析辉,hero]\b[hero]安南伯伯，温明叔叔怎么了！",
            "\t[安南奎,N546]\b[this]老七他……他不行了……",
            "\t[莫析辉,hero]\b[hero]怎么会，温明叔叔可是光明神殿的长老啊！安南伯伯，你怎么……",
            "\t[安南奎,N546]\b[this]我们已经是灵魂体了，老七的功力弱一些，所以不行了。我的功力深厚一点，还能与你说几句话……",
            "\t[莫析辉,hero]\b[hero]安南伯伯，您告诉我，是谁把您伤成这样的？",
            "\t[安南奎,N546]\b[this]辉儿，我会告诉你的，但不是让你去报仇，而是让你能够保护好自己！你已经是三大家族最后的希望了……",
            "\t[安南奎,N546]\b[this]东方溪、安撒绝没有那么大的能力击败我们几个，他们联手，或许能够打败你的父亲……但我和老七……却是在一个连我们都毫无察觉的高手偷袭之下才落败。",
            "\t[莫析辉,hero]\b[hero]什么！除了东方溪和安撒，还有一个隐藏的高手？那安南伯伯，您看清楚他长什么样了吗？",
            "\t[安南奎,N546]\b[this]我没有看清楚啊……咳咳……辉儿，保护好自己啊！",
            "\t[莫析辉,hero]\b[hero]安南伯伯，您安息吧，我一定，一定会为莫析、安南、温明三大家族讨一个公道的！",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        6
                    ]
                ],
                "floorId": "ZL1",
                "remove": true
            },
            "可以前往东凌帝国啦（从东凌走廊1进入）"
        ]
    },
    "changeFloor": {
        "0,1": {
            "floorId": "MT8",
            "loc": [
                12,
                1
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041],
    [ 94,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041],
    [10041,  0,10041,10041,10041,10041,10041,  0,10041,10041,10041,10041,10041],
    [10041,  0,10041,  0,  0,  0,10041,  0,10041,  0,  0,  0,10041],
    [10041,  0,10041,  0,552,  0, 86,  0, 86,  0,547,  0,10041],
    [10041,  0,10041,  0,  0,  0,10041,  0,10041,  0,  0,  0,10041],
    [10041,  0,10041,10041,10041,10041,10041,  0,10041,10041,10041,10041,10041],
    [10041,  0,10041,  0,415,  0,10041,  0,10041,703,  0,703,10041],
    [10041,  0,10041,  0,  0,  0, 86,  0, 86,  0,370,  0,10041],
    [10041,  0,10041,415,  0,415,10041,  0,10041,703,  0,703,10041],
    [10041,  0,10041,10041,10041,10041,10041,  0,10041,10041,10041,10041,10041],
    [10041,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10041],
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        0,
        1
    ]
}