main.floors.MT2=
{
    "floorId": "MT2",
    "title": "莫析家族2 ",
    "name": "莫析家族2",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "ground",
    "bgm": "21-30.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,6": [
            "\t[铁姝,npc0]\b[this]莫析少爷。",
            "\t[莫析辉,hero]\b[hero]铁姝姑娘，想不到，隐世学院一别，再见已是物是人非啊。",
            "\t[莫析辉,hero]\b[hero]如今的夜馨公会发展的也挺快的，没想到竟然可以这么快就掌握了只有莫析家族知道的地下通道。",
            "\t[铁姝,npc0]\b[this]莫析少爷过誉了，这一切还是默默的功劳。我把夜馨公会找到的情报交给您吧！",
            "\t[莫析辉,hero]\b[hero]有哪些情报呢？",
            "\t[铁姝,npc0]\b[this]东凌帝国与北寒帝国接壤，东部这片山区，一直由东凌帝国的莫析家族镇守。这片山区的水源则是流向北寒帝国，相当于掌握着北寒帝国的命脉。",
            "\t[莫析辉,hero]\b[hero]所以，北寒帝国是一直想战领这片山区了？",
            "\t[铁姝,npc0]\b[this]是的。可惜莫析家族太强了，北寒帝国拿下莫析家族，啧，代价太大，何况，莫析家族背后还有东凌皇室的支援呢。",
            "\t[莫析辉,hero]\b[hero]嗯。",
            "\t[铁姝,npc0]\b[this]不过，我们的情报，东凌帝国这次并没有出兵相助。不过殿下你也是看到了的，我们分析啊，东凌帝国也早就有灭掉莫析家族的心了。最重要的是，我们还在莫析家族附近，看到了南荒帝国的人。",
            "\t[莫析辉,hero]\b[hero]南荒帝国！？你是说，有三个帝国围剿莫析家族？",
            "\t[铁姝,npc0]\b[this]不一定，南荒帝国与莫析家族无冤无仇的，而且灭了莫析家族也对它们没有好处，好处全被东凌帝国和北寒帝国吞了，按理说，南荒帝国是不会参与这件事的。",
            "\t[莫析辉,hero]\b[hero]那他们来干什么？",
            "\t[铁姝,npc0]\b[this]别忘了，南荒帝国的二皇子与谁是联姻？",
            "\t[莫析辉,hero]\b[hero]北纳家族！蜜西娅！",
            "\t[铁姝,npc0]\b[this]圣子殿下，作为老同学，我们已经算是透露够多的了，你自己好好掂量掂量。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "MT1",
            "loc": [
                0,
                6
            ]
        },
        "0,6": {
            "floorId": "MT3",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041],
    [10041,691,10041,775,  0,690,  0,774,  0,700,  0,768,10041],
    [10041,611,10041,  0,10041,10041,10041, 81,10041,10041,10041,  0,10041],
    [10041, 21,10041, 21,10041,768,  0,691,  0,774,10041, 21,10041],
    [10041,768,10041,  0,10041, 81,10041,10041,10041, 81,10041,  0,10041],
    [10041,  0,10041,773,10041,  0,611,10041,611,  0,10041,775,10041],
    [ 92,135, 82,  0, 81,774,  0,10041,  0,772, 81,  0, 92],
    [10041, 81,10041,775,10041,  0,364,10041,699,  0,10041,774,10041],
    [10041,767,10041,  0,10041,10041,10041,10041,10041,10041,10041,  0,10041],
    [10041,363,10041,690,10041,690,369,768,604,690,10041,690,10041],
    [10041,363,10041, 81,10041,10041,10041, 81,10041,10041,10041,  0,10041],
    [10041,363,10041,774,  0, 21,  0,772,  0,364,1077,768,10041],
    [10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041,10041]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}