main.floors.NH1=
{
    "floorId": "NH1",
    "title": "南荒帝国 1 ",
    "name": "南荒帝国1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "grass",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,11": [
            "\t[凌依,N574]\b[this]为了防止被光明神殿发觉，我们兵分多路前往南荒帝国。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "GM1",
            "loc": [
                6,
                12
            ]
        },
        "1,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,703, 29,785, 21,616,684,140, 21, 21, 21, 21,140],
    [140,140,140, 81,140,140,140,140,140,615,784,343,140],
    [140,684,  0,783,  0,683,  0,784,  0,140, 81,140,140],
    [140,344,140,140,140,140,140,140, 81,140, 29, 30,140],
    [140, 21,140,683,  0,788, 81,  0,783,140,683, 22,140],
    [140,  0,140,140,140,140,140, 21,  0, 81,786,  0,140],
    [140,783,140,703,140,  0,784,  0, 27,140,140,140,140],
    [140,  0,140,785, 81, 28,140,140, 81,787, 21, 29,140],
    [140,683,140,703,140,  0,140, 29,785,140,140, 28,140],
    [140,  0,140,140,140, 81,140,140,684, 27,140,683,140],
    [140,784, 81,342,  0,783,  0,575,140,615,140,698,140],
    [140, 93,140,140,140,140, 91,140,140,140,140,140,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "yuanye.mp3",
    "flyPoint": [
        6,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}