main.floors.NH5=
{
    "floorId": "NH5",
    "title": "南荒帝国 5 ",
    "name": "南荒帝国5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "grass",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,  0,788,  0, 27,  0,788,  0,614,  0,785,  0,140],
    [140, 21,140,140,140,140,  0,140,140,140,140, 21,140],
    [140,  0,140,342, 21,140,684,140, 21,343,140,  0,140],
    [140,785,140,342, 21,140,786,140, 21,343,140,787,140],
    [140,345,140,342, 21,787,  0,787, 21,343,140,  0,140],
    [140,140,140,140,140,140, 83,140,140,140,140,1076,140],
    [140,  0,785,  0,702,  0,784,  0, 21,  0,140,  0,140],
    [140, 21,140,140,140,140, 82,140,  0,785, 82,788,140],
    [140,  0,140,683,683,140, 81,140,614,140,140,  0,140],
    [140,784,140,140, 81,140,  0,140,140,683,140, 21,140],
    [140,  0,787,  0, 28, 81,783,  0,786, 29,140,683,140],
    [140, 93,140,140,140,140,140, 91,140,140,140, 21,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "yuanye.mp3",
    "flyPoint": [
        7,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}