main.floors.NH7=
{
    "floorId": "NH7",
    "title": "南荒帝国 7 ",
    "name": "南荒帝国7",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "grass",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140, 22,140,684, 21,345,701,683,140,683,614, 22,140],
    [140,  0,140,140,140,787,140,140,140,614,684,614,140],
    [140,784,  0,614,  0,785,  0,701,140,683,614,787,140],
    [140,140,140,140,140, 81,140,140,140,140,140, 81,140],
    [140,  0, 28,  0,784,  0,614,  0,784,  0, 27,  0,140],
    [140,785,140,140, 82,140,140,140, 82,140,140,785,140],
    [140,  0,140,614,788,701,140,701,787,614,140,  0,140],
    [140, 21,140,683, 20, 21,140, 21, 20,683,140, 21,140],
    [140,  0,140,343, 20,345,140,345, 20,342,140,  0,140],
    [140,786,140,344,787,684,140,344,788,684,140,786,140],
    [140,  0,140,140,140,140,140,140,140,140,140,  0,140],
    [140, 93, 81, 81,784,684,785,684,784, 81, 81, 91,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "yuanye.mp3",
    "flyPoint": [
        11,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}