main.floors.NH7=
{
    "floorId": "NH7",
    "title": "南荒帝国 7 ",
    "name": "南荒帝国7",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 512,
    "defaultGround": "grass",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,12": {
            "floorId": "NH6",
            "loc": [
                11,
                12
            ]
        },
        "1,12": {
            "floorId": "NH8",
            "loc": [
                1,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 22, 20,684, 21,345,701,683, 20,683,614, 22, 20],
    [ 20,  0, 20, 20, 20,787, 20, 20, 20,614,684,614, 20],
    [ 20,784,  0,614,  0,785,  0,701, 20,683,614,787, 20],
    [ 20, 20, 20, 20, 20, 81, 20, 20, 20, 20, 20, 81, 20],
    [ 20,  0, 28,  0,784,  0,614,  0,784,  0, 27,  0, 20],
    [ 20,785, 20, 20, 82, 20, 20, 20, 82, 20, 20,785, 20],
    [ 20,  0, 20,614,788,701, 20,701,787,614, 20,  0, 20],
    [ 20, 21, 20,683, 20, 21, 20, 21, 20,683, 20, 21, 20],
    [ 20,  0, 20,343, 20,345, 20,345, 20,342, 20,  0, 20],
    [ 20,786, 20,344,787,684, 20,344,788,684, 20,786, 20],
    [ 20,  0, 20, 20, 20, 20, 20, 20, 20, 20, 20,  0, 20],
    [ 20, 93, 81, 81,784,684,785,684,784, 81, 81, 91, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "yuanye.mp3",
    "flyPoint": [
        11,
        12
    ],
    "bg2map": [

],
    "fg2map": [

]
}