main.floors.SN1=
{
    "floorId": "SN1",
    "title": "圣女宫 1 ",
    "name": "1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "T1067",
    "bgm": "ending.mp3",
    "firstArrive": [
        "\t[莫析辉,hero]\b[hero]圣女姐姐不是要请我一起练习光明法术么？怎么，放这么多怪物在这里？",
        "\t[蝶影,N432]\b[this,6,3]奴婢蝶影拜见圣子殿下！",
        "\t[蝶影,N432]\b[this,6,3]圣女殿下说，能不能修炼高深的光明法术，想先看看圣子殿下的实力够不够。",
        "\t[莫析辉,hero]\b[hero]呵，想为难我就直说呗！罗涛，给我开路！",
        "\t[罗涛,N582]\b[this,5,1]是！",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    1
                ]
            ],
            "remove": true
        },
        "\t[蝶影,N432]\b[this,6,3]圣子殿下，在圣女宫3楼或4楼，放着一件上好的法杖，击败怪物后可以获得魔力值……你拿到之后或许能更进一筹……",
        "\t[莫析辉,hero]\b[hero]什么？！",
        "\t[蝶影,N432]\b[this,6,3]没什么，奴婢告退！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    3
                ]
            ],
            "remove": true
        },
        "\t[莫析辉,hero]\b[hero]我刚刚没听错吧？蜜茜娅的侍女跟我讲这个……",
        "\r[red]\\c[20]之后的boss需要消耗一定数量的魔力值，本区魔力值不够，需要咸门拿魔力值\\c[]\r[]"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "GM1",
            "loc": [
                9,
                12
            ]
        },
        "11,12": {
            "floorId": "SN2",
            "loc": [
                11,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141, 93,141,141,141,141,141,141],
    [141, 21, 21, 21,  0,582,  0,141,606,  0,682,141,141],
    [141,141,141,141,141,141,  0,141,  0,598,  0,141,141],
    [141,218, 21,342,681,141,435,141,  0,215,  0,141,141],
    [141, 81,141,141,141,141,211,141,141, 81,141,141,141],
    [141,  0,  0,206,  0,710,  0,693,216,  0,  0,682,141],
    [141,141,141,141,141,141, 81,141,141,141,141,141,141],
    [141,  0,682,  0,206,  0,  0,  0,211,  0, 21,  0,141],
    [141,222,141,141, 81,141,141,141, 81,141,141,206,141],
    [141, 21,141,  0,213,  0,141,  0,214,  0,141,  0,141],
    [141, 22,141,  0,605,  0,141,  0, 30,  0,141,682,141],
    [141, 21,141,694,  0,682,141,344,  0,683,141,  0,141],
    [141,141,141,141,141,141,141,141,141,141,141, 93,141]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ]
}