main.floors.SN2=
{
    "floorId": "SN2",
    "title": "圣女宫 2 ",
    "name": "2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "T1067",
    "bgm": "ending.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,7": [
            "\t[罗涛,N582]\b[this]圣子殿下，这里是一个宝库，可以在里面获取很多东西。",
            "\t[莫析辉,hero]\b[hero]切，这种情报还用你说，还没蝶影告诉我的情报重要呢。",
            "\t[罗涛,N582]\b[this]什么？",
            "\t[莫析辉,hero]\b[hero]没什么。喂，你是圣子还是我是圣子，哪里轮得到你来质问我了？",
            "\t[罗涛,N582]\b[this]属下不敢，只是属下没有听清……",
            "\t[莫析辉,hero]\b[hero]对了，我最近修为延缓了不少，也不知道是不是希娜那个禁术的问题……",
            "\t[罗涛,N582]\b[this]额，殿下，应该是吧。希娜公主那种禁术，世人都颇为忌惮的……",
            "\t[莫析辉,hero]\b[hero]没道理啊……我跟她已经订婚了，她没必要害我的，我变强了，只会对她有好处……",
            "\t[罗涛,N582]\b[this]谁知道呢，希娜公主性情不定，否则也不会被赶出北寒皇室了。",
            "\t[莫析辉,hero]\b[hero]看得出，你对希娜的敌意很深呢。",
            "\t[罗涛,N582]\b[this]属下不敢，只是希娜公主对殿下如此这般，属下只是为殿下不平罢了。",
            "\t[莫析辉,hero]\b[hero]那这次去见蜜茜娅，她是个什么性子？",
            "\t[罗涛,N582]\b[this]圣女殿下平易近人，应该是能与殿下聊得来的。",
            "\t[莫析辉,hero]\b[hero]哦？那准圣子呢？",
            "\t[罗涛,N582]\b[this]准圣子殿下笑里藏刀，属下以为，殿下要小心才是。",
            "\t[莫析辉,hero]\b[hero]知道了。退下吧！",
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        7
                    ]
                ],
                "remove": true
            },
            "\t[莫析辉,hero]\b[hero]\\c[30]本层魔力门和白宝石红必须开，否则打不过boss，因为boss有法力燃烧属性。"
        ]
    },
    "changeFloor": {
        "11,12": {
            "floorId": "SN1",
            "loc": [
                11,
                12
            ]
        },
        "6,0": {
            "floorId": "SN3",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141, 91,141,141,141,141,141,141],
    [141,683,684,683, 82,  0,  0,  0,  0,  0,  0,  0,141],
    [141,141,141,141,141,141,141,141,141,141,141,  0,141],
    [141, 21,141,698,141,686,141,710,141, 21,141,  0,141],
    [141, 21,141,698,141, 82,141,710,141, 21,141,  0,141],
    [141, 21,141,698,141, 82,141,710,141, 21,141,  0,141],
    [141, 82,141, 81,141, 82,141, 81,141, 82,141,  0,141],
    [141,683,684,683, 82,682,682,682, 81,  0,  0,582,141],
    [141, 81,141, 82,141, 83,141, 82,141, 81,141,  0,141],
    [141, 81,141,700,141,415,141,712,141, 81,141,  0,141],
    [141, 81,141,700,141,601,141,712,141, 81,141,  0,141],
    [141, 22,141,700,141,415,141,712,141, 22,141,  0,141],
    [141,141,141,141,141,141,141,141,141,141,141, 91,141]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        12
    ]
}