main.floors.SN5=
{
    "floorId": "SN5",
    "title": "圣女宫 5 ",
    "name": "5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "T1067",
    "bgm": "ending.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,12": {
            "floorId": "SN4",
            "loc": [
                11,
                12
            ]
        },
        "0,12": {
            "floorId": "SN6",
            "loc": [
                0,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,5": [
            "\t[葛尔丹,N566]\b[this,2,1]咳咳，卢轩，我这些天实在是太疲惫了，你还是跟圣女妹妹去回绝一下，我是参加不了她的光明法术研讨会了……",
            "\t[卢轩,N578]\b[this,1,5]啊，是这样啊，那属下就去了。殿下您要好好休息呀。",
            "\t[葛尔丹,N566]\b[this,2,1]无妨无妨！",
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        5
                    ]
                ],
                "remove": true
            },
            "\t[葛尔丹,N566]\b[this,2,1]卢轩走了吗？",
            "\t[准涵,N436]\b[this,3,5]走了，殿下。",
            "\t[葛尔丹,N566]\b[this,2,1]哼，这个北纳蜜茜娅，可不是什么好东西！这次什么光明法术研讨，可不就是展示一下她的实力嘛，而且她布置这么多怪物在这里，不就是想暗中看看我们的实力如何吗？你啊，快去告诉一下圣子弟弟，别让圣子弟弟吃亏了。",
            "\t[准涵,N436]\b[this,3,5]殿下，您对圣子殿下真好。",
            "\t[葛尔丹,N566]\b[this,2,1]那是自然，圣子弟弟单纯，不像蜜西娅那般狡诈，我帮着他是应该的。",
            {
                "type": "jumpHero",
                "loc": [
                    5,
                    5
                ],
                "time": 500
            },
            {
                "type": "changePos",
                "direction": "left"
            },
            "\t[莫析辉,hero]\b[hero]准圣子哥哥……",
            {
                "type": "turnBlock",
                "direction": "right",
                "loc": [
                    [
                        2,
                        1
                    ]
                ]
            },
            {
                "type": "turnBlock",
                "direction": "right",
                "loc": [
                    [
                        3,
                        5
                    ]
                ]
            },
            "\t[葛尔丹,N566]\b[this,2,1]圣子弟弟，你怎么来了。",
            "\t[莫析辉,hero]\b[hero]想不到，哥哥竟然对小弟这么好。",
            "\t[葛尔丹,N566]\b[this,2,1]圣子弟弟，你我兄弟之间，何必如此。我年长些许，自然要对圣子弟弟好了。对了，我这里有一件蕴灵甲，想必弟弟很是需要，就送给弟弟了。",
            "\t[莫析辉,hero]\b[hero]多谢哥哥，那蜜茜娅那边……",
            "\t[葛尔丹,N566]\b[this,2,1]我就不去了，圣子弟弟，那蜜西娅可没安好心，你当心点啊！",
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        1
                    ]
                ],
                "remove": true
            },
            "\t[准涵,N436]\b[this,3,5]圣子殿下，奴婢告退！",
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        5
                    ]
                ],
                "remove": true
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141,141,141,141,141,141,141,141],
    [141,631,566,  0,  0,10156,141,682,141,  0,683,  0,141],
    [141,10136,10137,10138,  0,694,141,  0, 81,213, 21,607,141],
    [141,10144,10145,10146,  0,683,141,  0,141,141,141,141,141],
    [141,10152,10153,10154,  0,710,141,206,214,  0,349,683,141],
    [141,581,  0,439,  0,  0, 82,  0,141,141,141,141,141],
    [141,141,141,141,141,141,141, 21,141,  0, 81,206,141],
    [141,  0,213,  0,344,  0,218,  0,141,218,141,  0,141],
    [141,  0,141,141,141,141,141,211,141,598,141, 21,141],
    [141,682,141,682,348,694,141,  0,141,346,141,  0,141],
    [141,  0, 81,206,710,211, 82,682,141,141,141,211,141],
    [141,211,141,682,347,694,141,  0,206, 81,  0,  0,141],
    [ 92,  0,141,141,141,141,141,141,141,141,141, 91,141]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        12
    ]
}