main.floors.SR1=
{
    "floorId": "SR1",
    "title": "深入 1 ",
    "name": "深入1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "grass",
    "bgm": "mingyuetianya.mp3",
    "firstArrive": [
        "\t[莫析辉,hero]\b[hero]哟，不知是哪阵风把圣女姐姐吹到了这里来呢？",
        "\t[蜜西娅,N489]\b[this,6,10]圣子弟弟别贫嘴啊，光明神殿的圣子，竟然输给了黑暗圣子，据说那黑暗圣子与你差不多大呢。",
        "\t[莫析辉,hero]\b[hero]呵，别说我没打赢他，圣女姐姐你虚长我几岁，也未必能打赢他哦。",
        "\t[蜜西娅,N489]\b[this,6,10]是吗？那弟弟你可要看好了，姐姐这就去抓住黑暗圣子给你瞧瞧。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "remove": true
        },
        "\t[莫析辉,hero]\b[hero]嘁！我倒看看你能不能打赢黑暗圣子！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,7": [
            {
                "type": "confirm",
                "text": "确认要打开这个宝箱吗? (花费200点魔力)",
                "yes": [
                    {
                        "type": "if",
                        "condition": "(status:mana<200)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "操作失败"
                            },
                            "你的魔力不足!"
                        ],
                        "false": [
                            {
                                "type": "setValue",
                                "name": "status:mana",
                                "operator": "-=",
                                "value": "200"
                            },
                            {
                                "type": "playSound",
                                "name": "door.mp3"
                            },
                            {
                                "type": "setBlock",
                                "number": "X60341"
                            },
                            "获得十阶血红宝石一枚、七阶黄宝石一枚、黄钥匙三把",
                            {
                                "type": "setValue",
                                "name": "item:I614",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "item:I366",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "item:yellowKey",
                                "operator": "+=",
                                "value": "3"
                            }
                        ]
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "CZ10",
            "loc": [
                6,
                0
            ]
        },
        "0,6": {
            "floorId": "SR2",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [ 92,  0,151,151,151,151,151,151,151,151,151,151,151],
    [151, 21,151,690,151, 21,151,60549,  0,604,151,689,20284],
    [151, 21,151,689,151, 21,151,  0,746,  0,151,363,151],
    [151, 21,151,749,151,748,151,151, 81,151,151,747,151],
    [151,  0,151, 81,151,  0,489,151,  0,151,151, 81,151],
    [151,748, 81,  0,  0,  0,  0,  0,750, 81,702,689,151],
    [151,151,151,151,151,151, 91,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [  0,  0,20295,  0,  0,  0,  0,  0,  0,  0,20295,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,20294,  0,  0,  0,20276],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}