main.floors.SR11=
{
    "floorId": "SR11",
    "title": "深入 11 ",
    "name": "深入11",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "grass",
    "bgm": "mingyuetianya.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            "\t[凌依,N574]\b[this]圣子殿下，你还好吗？",
            "\t[莫析辉,hero]\b[hero]我感觉不太好，是你找来了几位长老吗？",
            "\t[凌依,N574]\b[this]是的，圣子殿下，你被黑暗神殿抓去的时候，我感到十分焦急，但可惜自己能力有限，只能找几位长老去救你了。",
            "\t[莫析辉,hero]\b[hero]嗯，谢谢你。",
            "\t[凌依,N574]\b[this]这是卑职应该做的。对了，圣子殿下，这种白门，很是稀奇，圣子殿下想想法子，应该可以打开……",
            "\t[莫析辉,hero]\b[hero]嗯，我知道了。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "SR10",
            "loc": [
                6,
                12
            ]
        },
        "11,0": {
            "floorId": "SR12",
            "loc": [
                11,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [152,152,152,152,152,152,152,152,152,152,152, 91,152],
    [152,691,152,  0, 21,  0,734,  0,690,  0,733,  0,152],
    [152,712,152,733,152,152,152,152,152,152,152, 81,152],
    [152,366,152,  0,698,734,  0, 81,732,  0,365,733,152],
    [152,735, 81,610,  0,152,612,152,  0,690,  0,  0,152],
    [152,152,152,152,152,152, 21,152,152,152,152,152,152],
    [152,733,361, 21,732, 82,  0,152,  0,690,690,690,152],
    [152,602,152,152,152,152,  0, 81,735,358,358,358,152],
    [152,610,152,365,365,152,732,152,152,152,152,152,152],
    [152,360,152,365,734, 81,  0,152,  0,603,603,603,152],
    [152,697,152,152,152,152,574,1077,751,  0,691,  0,152],
    [152,734,690,360,733, 81,  0,152,  0, 22, 22, 22,152],
    [152,152,152,152,152,152, 91,152,152,152,152,152,152]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}