main.floors.SR15=
{
    "floorId": "SR15",
    "title": "深入 15 ",
    "name": "深入15",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "grass",
    "bgm": "mingyuetianya.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,1": [
            "\t[莫析辉,hero]\b[hero]咦？这是……神像？",
            "\t[贪婪之神,moneyShop]\b[this]凡人啊，我是魔塔界的贪婪之神！信奉我吧，我将赐予你力量。",
            "\t[莫析辉,hero]\b[hero]贪婪之神？可是，我已经信奉光明之神了唉！",
            "\t[贪婪之神,moneyShop]\b[this]愚昧啊，我贪婪之神可以给予你更多，难道信奉我不好吗？",
            "\t[莫析辉,hero]\b[hero]哦，好啊，那我就不信奉光明之神了……",
            {
                "type": "animate",
                "name": "thunder",
                "loc": [
                    10,
                    2
                ]
            },
            "\t[贪婪之神,moneyShop]\b[this]啊！是谁劈我？",
            "\t[？？？]大胆贪婪之神，竟敢抢本座信徒！",
            "\t[贪婪之神,moneyShop]\b[this]你到底是谁？",
            "\t[？？？]我就是光明之神！受死吧！",
            {
                "type": "animate",
                "name": "thunder",
                "loc": [
                    10,
                    2
                ]
            },
            "\t[贪婪之神,moneyShop]\b[this]啊啊啊啊啊！",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        1
                    ]
                ],
                "remove": true
            },
            "\t[莫析辉,hero]\b[hero]……",
            "\t[？？？]光明圣子，听说你要改信仰？",
            "\t[莫析辉,hero]\b[hero]哈哈，怎么会呢？光明之神，我是您最忠实的信徒啊！",
            "\t[？？？]罢了，可能本座平日对你苛刻了一些，这样吧，本座教你炼钥之法，可以炼制光明之钥和黑暗之钥……",
            "\t[莫析辉,hero]\b[hero]啊？黑暗之钥？光明之神炼黑暗之钥？多谢神明！",
            {
                "type": "openShop",
                "id": "shop4",
                "open": true
            },
            {
                "type": "function",
                "function": "function(){\ncore.AllSprites()\n}"
            },
            "解锁了黑白钥匙，状态栏将增加显示白钥匙和黑钥匙。"
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "SR14",
            "loc": [
                12,
                6
            ]
        },
        "6,12": {
            "floorId": "SR16",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,691,152,691,152,691,691,691,152,  7,131,  8,152],
    [152,690,152,372,152,362,362,362,152,  0,  0,  0,152],
    [152,698,152,371,152,152,1077,152,152,152, 83,152,152],
    [152,603,152,231,  0,690,  0,751,  0,232,  0, 21,152],
    [152,734,152,152, 81,152,152,152, 81,152,152,152,152],
    [152,735,152,698,734,610,611,152,  0,361,152,  0, 92],
    [152,734, 81,690,602,361, 21,152,690,  0,733,  0,152],
    [152,152,152,152, 81,152,152,152,152,152, 81,152,152],
    [152,  0,690,  0,751,152, 21, 21, 21,735,  0,  0,152],
    [152,735,152,152,152,152,152,152,152,152,152,734,152],
    [152,  0,611, 81,734,  0,  0,733, 82,  0,365,  0,152],
    [152,152,152,152,152,152, 93,152,152,152,152,152,152]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}