main.floors.SR20=
{
    "floorId": "SR20",
    "title": "深入 20 ",
    "name": "深入20",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "grass",
    "bgm": "mingyuetianya.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "SR19",
            "loc": [
                6,
                12
            ]
        },
        "6,0": {
            "floorId": "SR21",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,8": [
            {
                "type": "changePos",
                "direction": "up"
            },
            "\t[莫析辉,hero]\b[hero]住手，墨奈！",
            "\t[墨奈,N477]\b[this,6,2]哈哈哈哈，莫析辉，你来了。",
            "\t[莫析辉,hero]\b[hero]蜜茜娅！",
            "\t[蜜茜娅,N489]\b[this,5,4]哼！",
            "\t[墨奈,N477]\b[this,6,2]莫析辉，你不要急，等我除掉这个碍事的，你就在光明神殿一家独大了，你就是唯一的光明教皇，不好么？",
            "\t[莫析辉,hero]\b[hero]光明骑士，都出来！",
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    3,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    4,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    5,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    7,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    8,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    9,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    3,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    4,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    5,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    7,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    8,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "light",
                "loc": [
                    9,
                    11
                ],
                "async": true
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        3,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        4,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        5,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        7,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        8,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        9,
                        10
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        3,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        4,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        5,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        7,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        8,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N443",
                "loc": [
                    [
                        9,
                        11
                    ]
                ],
                "async": true
            },
            {
                "type": "waitAsync"
            },
            "\t[众光明骑士,N440]为光明而战！",
            "\t[墨奈,N477]\b[this,6,2]哼，算你狠，撤！",
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        5,
                        4
                    ]
                ]
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        7,
                        4
                    ]
                ]
            },
            "\t[莫析辉,hero]\b[hero]圣女姐姐，你要怎么谢我啊？",
            "\t[蜜茜娅,N489]\b[this,5,4]怎么谢你？你被埋伏，是我找了几位长老前去营救，你的人骗我进入埋伏圈，还要我谢你？",
            "\t[莫析辉,hero]\b[hero]哼，我被埋伏，可不是你的人骗我进的埋伏圈吗？还有，几位长老是凌依找来的，你少给自己贴金了，没有你，我的守护骑士不会去找长老前去营救我么？但没有我，你今天就栽这里了。",
            "\t[蜜茜娅,N489]\b[this,5,4]你！好，多谢圣子弟弟救命之恩！哼！牧迟，咱们走！",
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        4
                    ]
                ],
                "remove": true
            },
            "\t[牧迟,N473]\b[this,7,4]圣子殿下，多谢相救！",
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        4
                    ]
                ],
                "remove": true
            },
            "\t[莫析辉,hero]\b[hero]切，这叫感谢我？都散了吧！",
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        11
                    ]
                ],
                "remove": true
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,9": [
            "\t[墨奈,N477]\b[this,6,2]蜜西娅，你的光明骑士死光了。还不考虑投降么？",
            "\t[蜜西娅,N489]\b[this,5,4]墨奈，黑暗终将被光明驱散，我是不会向黑暗屈服的！",
            "\t[墨奈,N477]\b[this,6,2]有骨气！众黑暗骑士，给我上！谁杀了蜜西娅奖一百瓶琼浆玉露！",
            "\t[蜜西娅,N489]\b[this,5,4]牧迟，你本来可以离开的，为了我折返，如今你后悔吗？",
            "\t[牧迟,N473]\b[this,7,4]圣女殿下，吾之忠诚即荣耀！能为殿下战死，属下死而无憾！",
            "\t[蜜西娅,N489]\b[this,5,4]好，那就让我们酣畅淋漓地战一场！"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20,80357,80422,80359, 20, 20, 20, 20, 20],
    [ 20,  0,  0,  0, 20,485, 91, 20, 20,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,477,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,228,228,228,228,228,  0,  0,  0, 20],
    [ 20,  0,  0,  0,228,490,  0,475,228,  0,  0,  0, 20],
    [80358,80358,80358,80358,80358,80358,  0,80358,80358,80358,80358,80358,80358],
    [  0,  0,  0,  0,228,228,228,228,228,  0,  0,  0,  0],
    [80358,80358,80358,80358,80358,80358,  0,80358,80358,80358,80358,80358,80358],
    [ 21, 21, 21,416,  0,  0,252,  0,  0,616,80272,80273,80274],
    [80358,80358,80358,80358,80358,80358, 83,80358,80358,80358,80358,80358,80358],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80240,80241,80242],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80248,80249,80250],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80256,80257,80258],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80264,80265,80266],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80240,80241,80242,80243,  0,  0,  0,  0,  0,  0,80244,80245,80246],
    [80248,80249,80250,80251,  0,  0,  0,  0,  0,  0,80252,80253,80254],
    [80256,80257,80258,80259,  0,  0,  0,  0,  0,  0,80260,80261,80262],
    [80264,80265,80266,80267,  0,  0,  0,  0,  0,  0,80268,80269,80270]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90340,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90348,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90348,  0,  0,  0,  0,  0,  0],
    [80350,80350,80350,80350,80350,80350,90340,80350,80350,80350,80350,80350,80350],
    [80358,80358,80358,80358,80358,80358,90348,80358,80358,80358,80358,80358,80358],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}