main.floors.SR22=
{
    "floorId": "SR22",
    "title": "深入 22 ",
    "name": "深入22",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "autotile7",
    "bgm": "tiankong.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": [
            "\t[莫析辉,hero]\b[hero]默默?你怎么来到这里了？",
            "\t[默默,N481]\b[this]圣子哥哥在前面为我们村庄报仇，默默也不能在后面无动于衷啊！",
            {
                "type": "choices",
                "text": "\t[默默,N481]默默这里有一件至宝，可以对付黑暗圣子的，圣子哥哥要吗？",
                "choices": [
                    {
                        "text": "当然要了",
                        "action": [
                            "\t[莫析辉,hero]\b[hero]有这等好宝贝?那我当然要了！",
                            {
                                "type": "setValue",
                                "name": "item:hammer",
                                "operator": "+=",
                                "value": "1"
                            },
                            "\t[默默,N481]\b[this]圣子哥哥加油！默默会祝福圣子哥哥的！",
                            {
                                "type": "hide",
                                "remove": true
                            }
                        ]
                    },
                    {
                        "text": "当然不要",
                        "action": [
                            "\t[莫析辉,hero]\b[hero]算了，这件宝贝你留着防身吧！身为光明神殿的圣子，与圣女联手二打一已经是不好了，再用这个有损我的威名。",
                            "\t[默默,N481]\b[this]好叭，那我会在圣子哥哥后面给圣子哥哥加油哦！",
                            {
                                "type": "hide",
                                "remove": true
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "SR21",
            "loc": [
                12,
                6
            ]
        },
        "0,6": {
            "floorId": "SR23",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [120037,120038,120038,120038,120038,120038,120038,120038,120038,120038,120038,120038,120039],
    [120045,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120047],
    [120045, 21,120007,690,120007,415,120007,415,120007,699,120007, 21,120047],
    [120045, 21,120007,690,120007,415,120007,415,120007,699,120007, 21,120047],
    [120045, 21,120007,690,120007,415,120007,415,120007,699,120007, 21,120047],
    [120045, 82,120007, 81,120007, 83,120007, 83,120007, 81,120007, 82,120047],
    [ 92,  0,  0,  0,  0,  0,483,  0,  0,  0,  0,  0, 92],
    [120045, 81,120007, 82,120007,1076,120007,1077,120007, 82,120007, 81,120047],
    [120045, 81,120007,700,120007,691,120007,691,120007,691,120007, 81,120047],
    [120045, 81,120007,700,120007, 23,120007, 23,120007,691,120007, 81,120047],
    [120045, 22,120007,700,120007,691,120007,691,120007,691,120007, 22,120047],
    [120045,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120047],
    [120053,120054,120054,120054,120054,120054,120054,120054,120054,120054,120054,120054,120055]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}