main.floors.SR29=
{
    "floorId": "SR29",
    "title": "深入 29 ",
    "name": "深入29",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "autotile7",
    "bgm": "tiankong.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "SR30",
            "loc": [
                6,
                12
            ]
        },
        "6,0": {
            "floorId": "SR28",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,4": [
            {
                "type": "setValue",
                "name": "flag:door_SR29_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,4": [
            {
                "type": "setValue",
                "name": "flag:door_SR29_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,3": [
            {
                "type": "setValue",
                "name": "flag:door_SR29_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "5,3": [
            {
                "type": "setValue",
                "name": "flag:door_SR29_6_5",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,5": {
            "0": {
                "condition": "flag:door_SR29_6_5==4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_SR29_6_5",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [120037,120038,120038,120038,120038,120038, 93,120038,120038,120038,120038,120038,120039],
    [120045,691,120007,691,366,120007,  0,120007,366,691,120007,691,120047],
    [120045,370,120007,364,120007,120007,  0,120007,120007,363,120007,370,120047],
    [120045,703,120007, 21,120007,758,  0,758,120007, 21,120007,703,120047],
    [120045,760,120007,759,120007,758,  0,758,120007,759,120007,760,120047],
    [120045, 81,120007, 81,120007,120007, 85,120007,120007, 81,120007, 81,120047],
    [120045,690,  0,758,  0, 82,  0, 82,  0,758,  0,690,120047],
    [120045, 81,120007,120007, 81,120007, 81,120007, 81,120007,120007, 81,120047],
    [120045,760,  0,120007,759,120007, 81,120007,759,120007,  0,760,120047],
    [120045,703,120007,120007, 21,120007, 81,120007, 21,120007,120007,703,120047],
    [120045,370,120007,365,363,120007,758,120007,364,365,120007,370,120047],
    [120045,691,120007,690,604,120007,  0,120007,604,690,120007,691,120047],
    [120053,120054,120054,120054,120054,120054, 93,120054,120054,120054,120054,120054,120055]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ]
}