main.floors.SR3=
{
    "floorId": "SR3",
    "title": "深入 3 ",
    "name": "深入3",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "grass",
    "bgm": "mingyuetianya.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,9": [
            "\t[默默,N481]\b[this]呜呜呜……",
            "\t[莫析辉,hero]\b[hero]默默！这里怎么回事？",
            "\t[默默,N481]\b[this]呜呜呜，圣子哥哥，呜呜呜，是那黑暗神殿的黑暗圣子干的，我全村都被屠了，呜呜呜呜……",
            "\t[莫析辉,hero]\b[hero]墨奈！可恶的墨奈！",
            "\t[默默,N481]\b[this]呜呜呜，圣子哥哥，你一定要为死去的村民做主啊！",
            "\t[莫析辉,hero]\b[hero]好，默默，我一定不会放过黑暗圣子的！",
            "\t[默默,N481]\b[this]嗯嗯！谢谢哥哥。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "11,12": {
            "floorId": "SR2",
            "loc": [
                11,
                12
            ]
        },
        "6,0": {
            "floorId": "SR4",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151, 91,151,151,151,151,151,151],
    [151,604,151,373,151,  0,  0,  0,151,613,369,700,151],
    [151,366,151,368,151,689,  0,689,151,  0,690,  0,151],
    [151,700,151,747,151,151,748,151,151,  0,742,  0,151],
    [151,  0,746, 82,  0,689,  0,747,151,151, 81,151,151],
    [151,151,456,151,743,151,151, 81,453,151,749,151,151],
    [151, 21, 21,151,  0,151,360,  0,750, 81,  0,689,151],
    [151, 22, 21,151, 21,151,  0,689,151,151,151,748,151],
    [151, 21, 21,151,750,151,747,  0,151,747, 81,  0,151],
    [151,151,742,151,  0,151, 81,151,151,  0,458,482,151],
    [151,689,  0,455,  0,460,  0,689,151,365,151,  0,151],
    [151,  0,748, 81,  0,749,710,  0,743,  0,151,  0,151],
    [151,151,151,151,151,151,151,151,151,151,151, 91,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        12
    ]
}