main.floors.XW2=
{
    "floorId": "XW2",
    "title": "西武帝国 2 ",
    "name": "西武帝国2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile7",
    "bgm": "lfmg.mp3",
    "weather": [
        "rain",
        5
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,6": {
            "floorId": "XW1",
            "loc": [
                0,
                6
            ]
        },
        "6,11": {
            "floorId": "XW3",
            "loc": [
                6,
                11
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,144,144,144,144,144,144,  0,  0,144,144],
    [  0,  0,  0,144,  0,  0,  0,  0,144,  0,  0,144,  0],
    [144,144,  0,144,  0,144,  0,  0,144,  0,144,144,  0],
    [144,  0,  0,144,  0,144,  0,  0,144,  0,  0,  0,  0],
    [144,  0,  0,  0,  0,144,  0,144,144,144,144,144,  0],
    [144,144,144,144,  0,144,  0,  0,  0,  0,  0,  0,  0],
    [ 94,  0,  0,144,  0,144,  0,144,144,144,144,144,  0],
    [144,  0,  0,144,  0,144,  0,144,  0,  0,  0,  0,  0],
    [144,  0,  0,  0,  0,  0,  0,144,  0,144,144,144,144],
    [144,144,  0,144,144,144,  0,144,  0,144,  0,  0,  0],
    [144,  0,  0,  0,  0,144,  0,144,  0,144,  0,144,  0],
    [144,  0,  0,  0,  0,144, 91,144,  0,  0,  0,144,  0],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        0,
        6
    ]
}