main.floors.XW2=
{
    "floorId": "XW2",
    "title": "西武帝国 2 ",
    "name": "西武帝国2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile7",
    "bgm": "lfmg.mp3",
    "weather": [
        "rain",
        5
    ],
    "firstArrive": [
        "\t[莫析辉,hero]\b[hero]这种黑色血瓶能够将我的生命值翻倍，叫做黑暗血瓶。看来黑暗神殿的宝物与众不同呢。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,6": {
            "floorId": "XW1",
            "loc": [
                0,
                6
            ]
        },
        "6,11": {
            "floorId": "XW3",
            "loc": [
                6,
                11
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [353,688,  0,144,144,144,144,144,144,617,617,144,144],
    [  0,  0,755,144,1022, 81,  0, 21,144,617,617,144, 21],
    [144,144, 81,144,  0,144,  0,  0,144,737,144,144,  0],
    [144, 21,  0,144,687,144,688,  0,144,  0,  0, 81,1022],
    [144,  0,1022, 81,  0,144,1023,144,144,144,144,144,  0],
    [144,144,144,144,  0,144,  0,  0,1024,  0,687,  0,  0],
    [ 94,  0,1118,144, 81,144,687,144,144,144,144,144, 81],
    [144,  0,  0,144,1024,144,  0,144,  0,  0,737,  0,  0],
    [144,  0,  0,1023,  0, 82,  0,144,  0,144,144,144,144],
    [144,144,851,144,144,144,1021,144,688,144,  0,851,  0],
    [144,  0,  0,  0,  0,144,  0,144,  0,144,  0,144, 22],
    [144, 21,687,688,356,144, 93,144,  0,934,  0,144,703],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        0,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}