main.floors.XW4=
{
    "floorId": "XW4",
    "title": "西武帝国 4 ",
    "name": "西武帝国4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile7",
    "bgm": "lfmg.mp3",
    "weather": [
        "rain",
        5
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,5": [
            "\t[林霄,N485]\b[this]林霄恭迎圣子殿下多时了。",
            "\t[莫析辉,hero]\b[hero]林霄！你竟然在这里埋伏本少爷！找死！",
            "\t[林霄,N485]\b[this]等一下！圣子殿下，你就不能等我将话说完吗？",
            "\t[莫析辉,hero]\b[hero]不能！你是黑暗圣子的守护骑士，我是光明圣子，我们能有什么话好说的！",
            "\t[林霄,N485]\b[this]别忘了，圣子殿下，我们圣子殿下曾经对你有过不杀之恩呢！",
            "\t[莫析辉,hero]\b[hero]但墨奈对我用了不少细碎的功夫折磨我！",
            "\t[林霄,N485]\b[this]圣子殿下这么恨我们殿下么？但殿下，你就不想知道为什么你和我们殿下样貌相似吗？",
            "\t[莫析辉,hero]\b[hero]无非是双生胎之类的说法吧，告诉你，就算墨奈与我是双生胎，但我已心属光明，不可能与墨奈同流合污的！",
            "\t[林霄,N485]\b[this]也许，比双生胎还要更亲密一些呢……",
            "\t[莫析辉,hero]\b[hero]什么意思？",
            "\t[林霄,N485]\b[this]殿下，不瞒您说，我们圣子殿下已经陨落了……",
            "\t[莫析辉,hero]\b[hero]哦？黑暗圣子陨落，你来告诉我干什么？如此喜事，我当庆贺一番才是！",
            "\t[林霄,N485]\b[this]圣子殿下，你不能这样，我们圣子殿下与你比血亲还亲，莫析家族被灭了，也许他是你能够救下来唯一的血亲了！你难道不想救自己的血亲吗？",
            "\t[莫析辉,hero]\b[hero]莫析家族被灭，你还敢说，这是你们黑暗神殿办的好事！",
            "\t[林霄,N485]\b[this]这是黑暗圣女的人干的。我们圣子殿下从未想过这种卑鄙无耻的方式来对付你。他只想在正面堂堂正正地击败你！而且我们圣子殿下……我想，大概是黛默琳干的……",
            "\t[莫析辉,hero]\b[hero]好叭，是我人傻，我无法忍受我最后一个至亲的离去。我就当你说的是真的……如果你是骗我，将我扼杀在黑暗神殿，我将无力反抗，希望你不是骗我吧……罢了，哪怕是骗，我现在所有的至亲都离去了，被黑暗神殿拿下了又如何呢……",
            "\t[林霄,N485]\b[this]多谢圣子殿下的信任，属下绝不敢欺骗您！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "XW3",
            "loc": [
                0,
                6
            ]
        },
        "11,0": {
            "floorId": "XW5",
            "loc": [
                11,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144, 91,144],
    [144, 21,  0, 21,144,  0,755, 81,1118,  0,144,1023,144],
    [144,  0, 21,  0,144,353,  0,144,  0,934,144,1022,144],
    [144,144, 81,144,144,144,144,144,144, 81,144,1023,144],
    [144,  0,851,  0,144,  0,  0,144,  0,  0,  0, 21,144],
    [144,  0,  0,486, 81,851,  0,1021,  0,617,  0,  0,144],
    [ 94,  0,  0,687,144,  0,  0,  0,144,144, 81,144,144],
    [144,144,144,144,144,144,144, 81,144,  0,934,  0,144],
    [144,  0, 22,851, 81,352,  0,737,144,687,  0, 21,144],
    [144,688,  0,  0,144,144,1021,144,144,144, 81,144,144],
    [144,144,144,144,144,  0,351,  0,144,  0,851,  0,144],
    [144,619,1022, 81,  0,687,  0,352,144,  0,  0,687,144],
    [352,  0,688,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        0,
        6
    ],
    "bg2map": [

],
    "fg2map": [

]
}