main.floors.XW5=
{
    "floorId": "XW5",
    "title": "西武帝国 5 ",
    "name": "西武帝国5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile7",
    "bgm": "lfmg.mp3",
    "weather": [
        "rain",
        5
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,0": {
            "floorId": "XW4",
            "loc": [
                11,
                0
            ]
        },
        "6,12": {
            "floorId": "XW6",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144, 93,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,144,  0,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,144,  0,144],
    [144,144,  0,144,144,144,  0,144,144,  0,  0,  0,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,144,144,  0],
    [144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [144,144,  0,144,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,  0,  0,  0,144,144,  0,144,144,144,  0,144,144],
    [144,  0,  0,  0,  0,  0,  0,  0,144,  0,  0,  0,144],
    [144,144,  0,144,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,  0,  0,  0,144,144,  0,144,144,144,  0,144,144],
    [144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,144],
    [144,144,144,144,144,144, 91,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        11,
        0
    ]
}