main.floors.XW9=
{
    "floorId": "XW9",
    "title": "西武帝国 9 ",
    "name": "西武帝国9",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile7",
    "bgm": "lfmg.mp3",
    "weather": [
        "rain",
        5
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": "XW8",
            "loc": [
                6,
                1
            ]
        },
        "2,1": {
            "floorId": "XW10",
            "loc": [
                6,
                0
            ]
        },
        "10,1": {
            "floorId": "HA1",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144,  0, 93,  0,144,  0, 93,  0,144,  0, 93,  0,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,144,  0,144,144,144,  0,144,144,144,  0,144,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,144,  0,144,144,  0,  0,  0,144,144,  0,144,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,144,  0,144,144,  0,  0,  0,144,144,  0,144,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,  0,  0,  0,144,  0,  0,  0,144,  0,  0,  0,144],
    [144,144,  0,144,144,144,  0,144,144,144,  0,144,144],
    [144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "flyPoint": [
        6,
        1
    ]
}