main.floors.YS4=
{
    "floorId": "YS4",
    "title": "隐世学院 4 ",
    "name": "隐世学院4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20061",
    "bgm": "cbzc.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,1": [
            "\t[???,N481]\b[this]来啊，来加入夜馨公会啦！哥哥叫什么名字呀？",
            "\t[莫析辉,hero]\b[hero]小妹妹，你好啊，我叫莫析辉，这个夜馨公会是什么呀？",
            "\t[???,N481]\b[this]哥哥好，我叫默默，是光明神殿西部村庄的，这个夜馨公会是我们举办的一个小公会，相当于是那种报团的势力啦。",
            "\t[默默,N481]\b[this]在隐世学院，有很多学生是没有背景的，以后找不到强大的势力做靠山，咱就抱团组建一个势力。哥哥要加入吗？",
            "\t[莫析辉,hero]\b[hero]哦，不好意思，我已经加入光明神殿了，不能再加入其他势力了。",
            "\t[默默,N481]\b[this]光明神殿？呵呵……",
            "\t[莫析辉,hero]\b[hero]默默，你笑什么？",
            "\t[默默,N481]\b[this]啊，没什么，可惜我没有资格加入光明神殿，感到十分遗憾呢。",
            "\t[莫析辉,hero]\b[hero]要是默默愿意的话，我可以让默默加入光明神殿哦。",
            "\t[默默,N481]\b[this]不用了，我要为夜馨公会做贡献。",
            "\t[莫析辉,hero]\b[hero]好，那你加油。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "11,1": [
            "\t[铁姝,npc0]\b[this]你好，我是铁姝，夜馨公会的骑士。",
            "\t[莫析辉,hero]\b[hero]啊哈？骑士？女骑士？",
            "\t[铁姝,npc0]\b[this]是的，阁下以为，女的不能当骑士吗？",
            "\t[莫析辉,hero]\b[hero]那倒没有，只是我所在的光明神殿，没有女骑士……",
            "\t[铁姝,npc0]\b[this]那光明圣女的守护骑士呢？他也是男的吗？",
            "\t[莫析辉,hero]\b[hero]光明圣女的守护骑士？你是说牧迟？哈哈哈，当然是男的了。",
            "\t[铁姝,npc0]\b[this]那看来光明神殿很保守，连女骑士也没有。",
            "\t[莫析辉,hero]\b[hero]呵呵，那不知你的实力在光明神殿能做什么呢？",
            "\t[铁姝,npc0]\b[this]我想，我应该不会逊色于那几位守护骑士吧！也许，我能达到圣骑士的层次呢？",
            "\t[莫析辉,hero]\b[hero]圣骑士……传说中的层次，神明的仆人，哪怕教皇爷爷见了，也得避让三分……我可不信你能达到圣骑士层次。",
            "\t[铁姝,npc0]\b[this]不信算了，我要去宣传夜馨公会了，别拦着我！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "11,12": {
            "floorId": "YS3",
            "loc": [
                11,
                12
            ]
        },
        "1,0": {
            "floorId": "YS5",
            "loc": [
                1,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140, 91,140,140,140,140,140,140,140,140,140,140,140],
    [140,  0,481,140,698,  0,357,140,689, 21,140,133,140],
    [140,244,689,140,  0,229,  0,140,356,251,140,688,140],
    [140, 81,140,140,140, 81,140,140,140, 81,140,  0,140],
    [140,  0,610,  0,736,  0,688,  0,246,  0, 82,244,140],
    [140,140,140,140,140,140,140, 81,140, 81,140,  0,140],
    [140,  0, 21,  0,246,  0,609,  0,140,246,140,688,140],
    [140,229,140,140, 81,140,140,244,140, 21,140, 81,140],
    [140,  0,140,  0,245,  0,140, 21,140,688,140,687,140],
    [140,687,140,602,  0,358,140,688,140, 21,140,  0,140],
    [140, 81,140,140,140,140,140,140,140,140,140,736,140],
    [140,246,  0,353,  0,251,  0,687,  0,244, 81,  0,140],
    [140,140,140,140,140,140,140,140,140,140,140, 91,140]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        12
    ]
}