main.floors.ZL3=
{
    "floorId": "ZL3",
    "title": "东凌走廊 3 ",
    "name": "东凌走廊3",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 4,
    "defaultGround": "X10006",
    "bgm": "zhuangkuoshishi.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,5": [
            {
                "type": "confirm",
                "text": "确认要打开这个宝箱吗?",
                "yes": [
                    {
                        "type": "if",
                        "condition": "(status:mana<50)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "操作失败"
                            },
                            "你的魔力不足!"
                        ],
                        "false": [
                            {
                                "type": "setValue",
                                "name": "status:mana",
                                "operator": "-=",
                                "value": "50"
                            },
                            {
                                "type": "playSound",
                                "name": "door.mp3"
                            },
                            {
                                "type": "setBlock",
                                "number": "X10111"
                            },
                            "获得三把黄钥匙",
                            {
                                "type": "setValue",
                                "name": "item:yellowKey",
                                "operator": "+=",
                                "value": "3"
                            }
                        ]
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "ZL2",
            "loc": [
                6,
                0
            ]
        },
        "12,6": {
            "floorId": "ZL4",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20336,20336,20336,20336,20336,20336, 93,20336,20336,20336,20336,20336,20336],
    [20336,691,690,366,764, 81,  0, 82,762,  0,365,  0,20336],
    [20336,20336,20336,20336,20336,20336,1076,20336,20336, 81,20336,763,20336],
    [20336,368,368,368,764, 81,762,20336,  0,763,20336,  0,20336],
    [20336,20336,20336,20336,20336,20336,  0,20336,611,612,20336, 21,20336],
    [20336,763,1077,699,20336,  0,690,20336,10110,700,20336,  0,20336],
    [20336,  0,20336,  0,20336, 81,20336,20336,20336, 81,20336,761, 94],
    [20336, 21,20336,761, 82,763,  0,611,20336,  0,20336,  0,20336],
    [20336,  0,20336,  0,20336,20336,20336,  0, 81,762,  0,690,20336],
    [20336,762,20336,690,  0,763,20336,761,20336,20336,765,20336,20336],
    [20336,  0,20336,20336,20336,  0,20336,362,20336, 21, 21, 21,20336],
    [20336,412,  0,764,  0,691,20336,691,20336,371,371,371,20336],
    [20336,20336,20336,20336,20336,20336,20336,20336,20336,20336,20336,20336,20336]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ]
}